{
  "id": "1_Biological_Psychology_chunk_34",
  "book_id": "1_Biological_Psychology",
  "source_file": "Biological Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Biological Psychology.txt",
  "chunk_index": 34,
  "text": "fatty acids linked to a phosphate group). Embedded among the phospholipids are cylindrical proteins that let certain chemicals pass.\n\nWhen at rest, the membrane maintains an electrical gradient, also known as polarization—a difference in electrical charge between the inside and outside of the cell. The inside of the membrane has a slight negative charge compared to the outside, mainly because of negatively charged proteins inside the cell. This difference in voltage is called the resting potential.\n\nResearchers measure the resting potential by inserting a very thin microelectrode into the cell body. The most common electrode is a fine glass tube filled with a salt solution. A reference electrode outside the cell completes the circuit. Connecting the electrodes to a voltmeter, we find that the neuron’s interior has a negative potential relative to its exterior. The magnitude varies, but a typical level is 270 millivolts (mV).\n\nForces Acting on Sodium and Potassium Ions\n\nIf charged ions could flow freely across the membrane, enough positive ions would enter to depolarize the membrane. However, the membrane is selectively permeable, letting some chemicals pass more freely than others. Oxygen, carbon dioxide, urea, and water are uncharged chemicals that cross freely through channels that are always open. Sodium, potassium, calcium, and chloride are charged ions that cross through channels (or gates) that are sometimes open and sometimes closed, as depicted in Figure 1.21. When the membrane is at rest, the sodium and potassium channels are closed, permitting almost no flow of sodium and only a small flow of potassium. Stimulation can open these channels, permitting freer flow.",
  "meta": {
    "char_count": 1700,
    "word_count": 262
  }
}