{
  "id": "1_Biological_Psychology_chunk_36",
  "book_id": "1_Biological_Psychology",
  "source_file": "Biological Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Biological Psychology.txt",
  "chunk_index": 36,
  "text": "in distribution of ions across the membrane. Sodium is more concentrated outside than inside, so just by the laws of probability, it is more likely to enter the cell than to leave. Sodium would enter rapidly if it could, but the sodium channels are closed.\n\nPotassium is subject to competing forces. Potassium is positively charged, and the inside of the cell is negatively charged, so the electrical gradient tends to attract potassium into the cell. However, potassium is more concentrated inside the cell than outside, so the concentration gradient tends to drive it out. (For an analogy, imagine many cats inside a room with food. The cats are attracted to the food, but when they get too crowded, some of them leave.) The potassium channels, almost completely closed, permit a small amount of potassium flow, more outward than inward, but the sodium–potassium pump continues pulling potassium back into the cell.\n\nWhy a Resting Potential?\n\nThe body invests much energy to operate the sodium–potassium pump that maintains the resting potential. Why is it worth so much energy? The resting potential prepares the neuron to respond rapidly. Excitation of the neuron opens sodium channels, letting sodium enter the cell rapidly. Because the membrane did its work in advance by keeping so much sodium outside, the cell is prepared to respond vigorously to a stimulus.\n\nCompare the resting potential of a neuron to a poised bow and arrow: An archer who pulls the bow in advance and then waits is ready to fire at the appropriate moment. The neuron uses the same strategy. The resting potential remains stable until the neuron is stimulated.\n\nThe Action Potential\n\nAxons send messages called action potentials. Let’s begin by considering what happens when the resting potential is disturbed.",
  "meta": {
    "char_count": 1789,
    "word_count": 291
  }
}