{
  "id": "1_Biological_Psychology_chunk_1",
  "book_id": "1_Biological_Psychology",
  "source_file": "Biological Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Biological Psychology.txt",
  "chunk_index": 1,
  "text": "f matter and antimatter had been equal, there could be no stars, planets, or anything else. Our universe has protons, neutrons, and electrons with particular imensions of mass and charge. It has four fundamental forces: gravity, electromagnetism, the strong nuclear force, and the weak nuclear force. Those properties and dimensions have values that seem arbitrary, but if they had been much different, stars and planets could not have developed, or if they had developed, they would not have lasted long enough for life to evolve. Life could have evolved in a slightly different universe - and, who knows, maybe some universes could have been even better - but many aspects of the universe had to be almost exactly what they are. One item that had to be narrowly constrained is the structure of a water molecule. In a water molecule, the two hydrogen ions form a 104.5° angle. Because of that angle, one end of the water molecule has a slight positive charge and the other has a slight negative charge. The charge difference enables water molecules to attract one another electrically by just the right amount. If water molecules attracted one another a bit less, all water would be a gas (steam). If the molecules attracted one another a bit more strongly, water would always be a solid (ice).\n\nWhy is the universe suitable for sustaining life? Maybe it's just a coincidence. (Lucky for us, huh?) Or maybe intelligence of some sort guided the formation of the universe. That hypothesis clearly goes beyond the reach of empirical science. Another possibility is that other universes exist, and we know about only the one in which life like ours could evolve. Physicists have persuasive theoretical reasons for supposing other universes, but that idea also goesbeyond the reach of empirical science.",
  "meta": {
    "char_count": 1799,
    "word_count": 299
  }
}