{
  "id": "1_Biological_Psychology_chunk_9",
  "book_id": "1_Biological_Psychology",
  "source_file": "Biological Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Biological Psychology.txt",
  "chunk_index": 9,
  "text": "their chance for survival.\n\nJust for fun, here is something you can try yourself: \n\nWhen you observe moths clustering around your house light at night, jingle some keys. If you manage to produce some high-frequency sound waves, the moths will react strongly. You managed to drive the moths “batty.”\n\nTo further illustrate the four types of biological explanation, consider how they all apply to another example, birdsong (Catchpole and Slater, 1995):\n\nType of Explanation\n\nPhysiological: A particular area of a songbird brain grows under the influence of testosterone; hence, it is larger in breeding males than in females or immature birds. That brain área enables a mature male to sing.\n\nOntogenetic: In certain species, a young male bird learns its song by listening to adult males. Development of the song requires certain genes and the opportunity to hear the appropriate song during a sensitive period early in life.\n\nEvolutionary: Certain pairs of species have similar calls. For example, dunlins and Baird’s sandpipers, two shorebird species, give their calls in distinct pulses, unlike other shorebirds. The similarity suggests that the two evolved from a single ancestor.\n\nFunctional: In many bird species, only the male sings. He sings only during the reproductive season and only in his territory. The functions of the song are to attract females and warn away other males.\n\nFields of therapy include clinical psychology, counseling psychology, school psychology, medicine, and allied medical practice such as physical therapy. These fields range from neurologists (who deal exclusively with brain disorders) to social workers and clinical psychologists, who need to recognize possible signs of brain disorder so they can refer a client to a proper specialist",
  "meta": {
    "char_count": 1771,
    "word_count": 275
  }
}