{
  "id": "1_Biological_Psychology_chunk_29",
  "book_id": "1_Biological_Psychology",
  "source_file": "Biological Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Biological Psychology.txt",
  "chunk_index": 29,
  "text": "ging to cause new genital infections.\n\nThe COVID-19 virus crosses the blood–brain barrier in mice, although we do not yet know about humans (Rhea et al., 2021). We do know that some people infected with that virus develop seizures, confusion (“brain fog”), or impairments of vision, taste, and smell. Even if the virus does not cross the blood–brain barrier, it could harm the brain by constricting capillaries, thus decreasing blood flow to the brain, and by triggering a great increase in the immune response. When immune cells become highly abundant, some of them attack the body’s organs, including the brain, instead of the virus itself.\n\nHow the Blood–Brain Barrier Works\n\nThe blood–brain barrier depends on the endothelial cells that form the walls of the capillaries. Outside the brain, cells along the capillaries are separated by small gaps, but in the brain, they join so tightly that they block almost anything from passage.\n\n“If the blood–brain barrier is such a good defense,” you might ask, “why don’t we have similar walls around all our organs?” The answer is that the barrier keeps out useful chemicals as well as harmful ones. For these chemicals to cross the blood–brain barrier, the brain needs special mechanisms. Because the membrane is made of fats, chemicals that dissolve in fats cross freely through the cell wall. Examples include oxygen, carbon dioxide, vitamins A and D, and all the drugs that affect the brain—from antidepressants and other psychiatric drugs to marijuana and heroin. How fast a drug crosses the blood–brain barrier determines how fast it affects behavior. Chemotherapy drugs do not cross the blood–brain barrier, and that is a major reason why brain cancers are so difficult to treat.",
  "meta": {
    "char_count": 1732,
    "word_count": 282
  }
}