{
  "id": "1_Biological_Psychology_chunk_4",
  "book_id": "1_Biological_Psychology",
  "source_file": "Biological Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Biological Psychology.txt",
  "chunk_index": 4,
  "text": "about researchers’ attempts to elaborate on that word somehow.\n\nThree Main Points to Remember\n\nThis book presents a great deal of factual information. Regardless of how many details you learn or forget, at least three general points should stick with you forever:\n\n1. Perception occurs in your brain. When something contacts your hand, the hand sends a message to your brain. You feel it in your brain, not your hand. Electrical stimulation of your brain could produce a hand experience even if you had no hand. A hand disconnected from your brain has no experience. Similarly, when you see something, the experience is in your head, not “out there.” You do not send “sight rays” out of your eyes, and even if you did, they wouldn’t do you any good. The chapter on vision elaborates on this point. Furthermore, what you perceive is not what something actually is. Colors are what the light rays cause your brain to do, and sounds are what air waves cause your brain to do. Light waves are not colors and air waves are not sounds.\n\n2. Mental activity and certain types of brain activity are, so far as we can tell, inseparable. This position is known as monism, the idea that the universe consists of only one type of being. (The opposite is dualism, the idea that minds are one type of substance and matter is another.) Nearly all neuroscientists and philosophers support some version of monism.\n\nIt is not easy to get used to the concept of monism. People sometimes ask whether brain activity causes thoughts, or whether thoughts direct the brain activity (e.g., Miller, 2010). According to monism, that question is like asking whether temperature controls the movement of molecules, or whether the movement of molecules causes temperature. Neither one causes the other.",
  "meta": {
    "char_count": 1771,
    "word_count": 301
  }
}