{
  "id": "1_Biological_Psychology_chunk_5",
  "book_id": "1_Biological_Psychology",
  "source_file": "Biological Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Biological Psychology.txt",
  "chunk_index": 5,
  "text": "whether brain activity causes thoughts, or whether thoughts direct the brain activity (e.g., Miller, 2010). According to monism, that question is like asking whether temperature controls the movement of molecules, or whether the movement of molecules causes temperature. Neither one causes the other.They are just different ways of describing the same thing.\n\n3. People differ from one another in countless ways, and many of the differences can be traced to differences in the brain. Close your eyes and imagine the Eiffel Tower. Do you suppose that other people have nearly the same experience when they picture it “in their mind’s eye”? Nope. Some people have an experience almost as clear and detailed as actually seeing something, and others have no visual experience at all. People vary in how well they recognize faces. They differ in their sensitivity to tastes, smells, and pain. They differ in their ability to understand voices in a noisy environment, and in their ability to recall personal experiences. They differ in how much sleep they need per night. The list goes on, and the behavioral differences are rooted in brain differences.\n\nBiological Explanations of Behavior\n\nCommonsense explanations of behavior often refer to intentional goals such as, “He did this because he was trying to ...” or “She did that because she wanted to ...” But often, we have no reason to assume intentions. A 4-month-old\nbird migrating south for the first time presumably does not know why. The next spring, when she lays an egg, sits on it, and defends it from predators, she doesn’t know why. Even humans don’t always know the reasons for their own behaviors. Yawning and laughter are two examples. You do them, but can you explain what they accomplish?",
  "meta": {
    "char_count": 1751,
    "word_count": 288
  }
}