{
  "id": "1_Biological_Psychology_chunk_19",
  "book_id": "1_Biological_Psychology",
  "source_file": "Biological Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Biological Psychology.txt",
  "chunk_index": 19,
  "text": "the disease progressed. However, researchers have found that minority group members are mostly willing to participate, if they are given proper explanations about the proposed research.\n\nModule 1.2 Neurons and Other Cells\n\nNeurons\n\nThe nervous system consists of two kinds of cells, neurons and glia. Neurons receive information and transmit it to other cells. We consider glia later in this module. According to the best estimate, the adult human brain contains approximately 86 billion neurons, on average. However, that number is just an average. People vary in their neuron numbers more than they vary in their height (von Bartheld et al., 2016).\n\nSantiago Ramón y Cajal, a Pioneer of Neuroscience \n\nTwo scientists of the late 1800s and early 1900s, who knew each other well, pioneered the field of neuroscience: Charles Sherrington, whom we shall discuss in the chapter on synapses, and Santiago Ramón y Cajal (1852–1934). Cajal’s early education did not progress smoothly. At one point, he was imprisoned in a solitary cell, limited to one meal a day, and taken out daily for public floggings—at the age of 10—for the crime of not paying attention during his Latin class (Cajal, 1901–1917/1937).\n\nCajal wanted to become an artist, but his father insisted that he study medicine as a safer way to make a living. He managed to combine the two fields, using his drawing skills to illustrate his medical research. His detailed drawings of the nervous system are still considered definitive today. One of his major contributions was an idea that we now take for granted—the idea that the brain consists of individual cells.\n\nDuring the 1800s biologists discovered that the body consists of cells, but at first, they were not sure that the same was true of the brain.",
  "meta": {
    "char_count": 1767,
    "word_count": 290
  }
}