{
  "id": "1_Biological_Psychology_chunk_17",
  "book_id": "1_Biological_Psychology",
  "source_file": "Biological Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Biological Psychology.txt",
  "chunk_index": 17,
  "text": "e from the Nobel Prize-winning biologist Niko Tinbergen, who argued that no fundamental gulf separates humans from other animal species. Because we are similar in many ways to other species, we learn much about ourselves from animal studies. Also because of that similarity, we wish not to hurt them. Neuroscience researchers who decide to conduct animal research do not, as a rule, take the decision lightly. They believe it is better to inflict distress under controlled conditions than to permit ignorance and disease to inflict greater distress. In some cases, however, it is a difficult decision.\n\nIssues in Human Research\n\nResearch with humans raises different types of ethical concerns. Brain surgery is sometimes conducted while a person is under only local anesthesia, and therefore awake. (The skin of the scalp has pain receptors, but the brain itself does not.) Sometimes a patient undergoing such surgery is invited to participate in a study where researchers will record from brain cells while presenting sensory stimuli. So far as we know, the procedure causes the patient no harm, but it also provides no benefit. The shaky part of the ethics is getting informed consent. If your surgeon asked you to participate, would you say yes, just to please your surgeon?\n\nAnother issue: Sometimes a patient with Parkinson’s disease has electrodes implanted to stimulate areas deep in the brain, after other types of treatment have failed. The procedure is usually successful, and usually without any serious negative effects, but occasionally the person shows troublesome behavioral changes. When that happens, is the individual personally responsible for the misbehavior? Or is it the fault of the electrodes?",
  "meta": {
    "char_count": 1717,
    "word_count": 271
  }
}