{
  "id": "1_Biological_Psychology_chunk_23",
  "book_id": "1_Biological_Psychology",
  "source_file": "Biological Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Biological Psychology.txt",
  "chunk_index": 23,
  "text": "y, Alzheimer’s disease, Parkinson’s disease, and Huntington’s disease.\n\nThe Structure of Neurons\n\nCompared to other cells, the most distinctive feature of neurons is their highly variable shape. All neurons include a soma (cell body), and most also have dendrites, an axon, and presynaptic terminals. The tiniest neurons lack axons, and some neurons lack well-defined dendrites. Contrast the motor neuron in and the sensory neuron. A motor neuron, with its soma in the spinal cord, receives excitation through its dendrites and conducts impulses along its axon to a muscle. A sensory neuron is specialized at one end to be highly sensitive to a particular type of stimulation, such as touch. The sensory neuron conducts touch information from the skin to the spinal cord. Tiny branches lead directly from the receptors into the axon, and the cell’s soma is located on a little stalk off the main trunk.\n\nDendrites are branching fibers that get narrower near their ends. The term dendrite comes from a Greek root word meaning “tree.” Giorgio Ascoli (2015) offers this analogy: If you expanded a dendrite to the height of a tree, the dendrite would be as thick as your little finger, its branches would be as thin as spaghetti, and the cell’s axon would extend for more than 25 city blocks.\n\nThe dendrite’s surface is lined with specialized synaptic receptors, at which the dendrite receives information from other neurons. Many dendrites contain dendritic spines, short outgrowths that increase the surface area available for synapses.\n\nThe cell body, or soma (Greek for “body”; plural: somata), contains the nucleus, ribosomes, and mitochondria. Cell bodies of neurons range in diameter from 0.005 millimeter (mm) to 0.1 mm in mammals, and up to a millimeter in certain invertebrates.",
  "meta": {
    "char_count": 1784,
    "word_count": 287
  }
}