{
  "id": "1_Biological_Psychology_chunk_8",
  "book_id": "1_Biological_Psychology",
  "source_file": "Biological Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Biological Psychology.txt",
  "chunk_index": 8,
  "text": "0,000 Hz, which we regard as ultrasonic, a moth turns and flies away from the sound source. If the sound gets louder, the moth either dives for the ground or flies erratically. The physiological explanation starts with the moth’s ears, which are sensitive only to sound waves at 20,000 to 100,000 Hz. When the sound is louder in one ear than in the other, it triggers a reflex that turns the moth until the two ears respond equally, enabling the moth to fly away. At a certain level of loudness, the ears respond equally and at maximum, no matter where the moth turns. At that point, connections in the moth’s head stimulate either a dive or helter-skelter flight (Roeder, 1967).\n\nA functional explanation deals with why the moth’s hearing system evolved this way. Moths in flight are vulnerable to attack by bats that find moths by emitting calls at 20,000 to 100,000 Hz and listening for echoes. As soon as a moth hears anything, it treats it as danger. By turning until the ears are equally stimulated, it can fly away from the bat. A moth can hear bat calls when the bat is too far away to hear the echo. If the bat gets close enough to hear an echo, that is the distance at which the bat’s calls will be so loud to the moth that both ears reach maximum response. At that point, flying away is no longer a good strategy, because bats are faster. Diving for the ground or flying helter-skelter might work. Probably not, but worth a try. The moths evolved a simple hearing system that increases their chance for survival.\n\nJust for fun, here is something you can try yourself: \n\nWhen you observe moths clustering around your house light at night, jingle some keys. If you manage to produce some high-frequency sound waves, the moths will react strongly. You managed to drive the moths “batty.”",
  "meta": {
    "char_count": 1795,
    "word_count": 321
  }
}