{
  "id": "1_Biological_Psychology_chunk_10",
  "book_id": "1_Biological_Psychology",
  "source_file": "Biological Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Biological Psychology.txt",
  "chunk_index": 10,
  "text": "y, medicine, and allied medical practice such as physical therapy. These fields range from neurologists (who deal exclusively with brain disorders) to social workers and clinical psychologists, who need to recognize possible signs of brain disorder so they can refer a client to a proper specialist\n\nAnyone who pursues a career in research needs to stay up to date on new developments by attending conventions, consulting with colleagues, and reading research journals, such as Neuron, Journal of Neuroscience, Neurology, Behavioral Neuroscience, Brain Research, Nature Neuroscience, Journal of Cognitive Neuroscience, and Archives of General Psychiatry. But what if you are entering a field on the outskirts of neuroscience, such as clinical psychology, school psychology, social work, or physical therapy? In that case, you want to stay current on major developments, at least enough to converse intelligently with medical colleagues.\n\nNeuroethics\n\nResearch in biological psychology and related fields attempts to understand and sometimes modify behavior. Difficult ethical issues arise.\n\nIssues Concerning Animal Research\n\nSeveral ethical disputes resist agreement. Among those issues are abortion and the use of animals in research. In both cases, well-meaning people on each side of the issue insist that their position is proper and ethical. The dispute is not between good people and bad people. It is between two views of what is Good.\n\nGiven that most biological psychologists and neuroscientists are primarily interested in the human brain and human behavior, why do they study nonhumans? Here are four reasons:\n\n1. Many of the mechanisms of behavior are similar across species, and sometimes they are easier to study in a nonhuman species.",
  "meta": {
    "char_count": 1750,
    "word_count": 264
  }
}