{
  "id": "1_Biological_Psychology_chunk_11",
  "book_id": "1_Biological_Psychology",
  "source_file": "Biological Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Biological Psychology.txt",
  "chunk_index": 11,
  "text": "that most biological psychologists and neuroscientists are primarily interested in the human brain and human behavior, why do they study nonhumans? Here are four reasons:\n\n1. Many of the mechanisms of behavior are similar across species, and sometimes they are easier to study in a nonhuman species. If you want to understand a complex machine, you might begin by examining a simpler machine. We also learn about brain–behavior relationships by starting with simpler cases. Much research has been conducted on squid nerves, which are thicker than human nerves and therefore easier to study. The roundworm Caenorhabditis elegans has only 302 neurons, the same for all individuals, enabling researchers to map all the cells and all their interconnections. The sea slug Aplysia also has neurons that are almost always the same, including many large ones that are easy to study. Many vertebrates also have brains that are easy to study, and their brains resemble human brains in many regards.\n\n2. We are interested in animals for their own sake. Humans are naturally curstious. We would like to understand how bats chase insects in the dark, how migratory birds find their way over unfamiliar territory, how schools of fish manage to swim in unison, and much more.\n\n3. What we learn about animals sheds light on human evolution. How do we resemble chimpanzees and other primates, and how do we differ from them? Why and how did primates evolve larger brains than other species?\n\n4. Legal or ethical restrictions prevent certain kinds of research on humans. Investigators sometimes insert electrodes into the brains of rats and other animals to determine the relationship between brain activity and behavior. They also inject chemicals, extract brain chemicals, and study the effects of brain damage.",
  "meta": {
    "char_count": 1795,
    "word_count": 289
  }
}