{
  "id": "1_Biological_Psychology_chunk_37",
  "book_id": "1_Biological_Psychology",
  "source_file": "Biological Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Biological Psychology.txt",
  "chunk_index": 37,
  "text": "ts is ready to fire at the appropriate moment. The neuron uses the same strategy. The resting potential remains stable until the neuron is stimulated.\n\nThe Action Potential\n\nAxons send messages called action potentials. Let’s begin by considering what happens when the resting potential is disturbed. When an axon’s membrane is at rest, a microelectrode, shows a negative potential inside the axon. If we now use a different electrode to increase the negative charge, we can produce hyperpolarization, which means increased polarization. When the stimulation ends, the charge returns to its original resting level.\n\nNow let’s apply a brief current to depolarize the neuron—that is, reduce its polarization toward zero.\n\nWith a slightly stronger depolarizing current, the potential rises slightly higher but again returns to the resting level.\n\nNow let’s apply a still stronger current. When the potential reaches the threshold, the membrane opens its sodium channels and permits sodium ions to flow into the cell, driving the membrane potential upward, far beyond what the stimulus itself provided.\n\nAny subthreshold stimulation produces a small response that quickly decays. Any stimulation beyond the threshold, regardless of how far beyond, produces a big response like the one depicted, known as the action potential. The peak of the action potential, shown as 130 mV in this illustration, varies from one axon to another, but it is consistent for a given axon.\n\nThe All-or-None Law\n\nAny depolarization that reaches or passes the threshold produces an action potential. For a given neuron, all action potentials are approximately equal in amplitude (intensity) and velocity. Slight variations occur spontaneously, but not because of the stimulus.",
  "meta": {
    "char_count": 1750,
    "word_count": 268
  }
}