{
  "id": "1_Biological_Psychology_chunk_27",
  "book_id": "1_Biological_Psychology",
  "source_file": "Biological Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Biological Psychology.txt",
  "chunk_index": 27,
  "text": "inappropriate synapses is an important process. Either too much pruning or too little pruning during early development leads to developmental disorders. Yet another function of microglia is to provide negative feedback to put the brakes on neuronal activity. A loss of microglia leads to seizures.\n\nOligodendrocytes (OL-i-go-DEN-druh-sites) in the brain and spinal cord and Schwann cells in the periphery of the body build the myelin sheaths that surround and insulate certain vertebrate axons. They also supply an axon with nutrients necessary for proper functioning. Oligodendrocytes respond to neural activity by altering the myelin sheaths, thereby altering the timing of axons’ responses. In that way they participate in certain types of learning and memory. Radial glia guide the migration of neurons and their axons and dendrites during embryonic development.\n\nThe Blood–Brain Barrier \n\nAlthough the brain, like any other organ, needs to receive nutrients from the blood, many chemicals cannot cross from the blood to the brain. The mechanism that excludes most chemicals from the vertebrate brain is known as the blood–brain barrier. First, let’s consider why we need it.\n\nWhy We Need a Blood–Brain Barrier\n\nWhen a virus invades a cell, mechanisms within the cell extrude virus particles through the membrane so that the immune system can find them. When the immune system cells find a virus, they kill it and the cell that contains it. In effect, a cell exposing a virus through its membrane says, “Look, immune system, I’m infected with this virus. Kill me and save the others.”\n\nThis plan works well if the virus-infected cell is a skin cell or a blood cell, which the body replaces easily. However, with almost no exceptions, the vertebrate brain cannot replace damaged neurons.",
  "meta": {
    "char_count": 1790,
    "word_count": 283
  }
}