{
  "id": "1_Biological_Psychology_chunk_38",
  "book_id": "1_Biological_Psychology",
  "source_file": "Biological Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Biological Psychology.txt",
  "chunk_index": 38,
  "text": "r a given axon.\n\nThe All-or-None Law\n\nAny depolarization that reaches or passes the threshold produces an action potential. For a given neuron, all action potentials are approximately equal in amplitude (intensity) and velocity. Slight variations occur spontaneously, but not because of the stimulus. More properly stated, the all-or-none law is that the amplitude and velocity of an action potential are independent of the intensity of the stimulus that initiated it, provided that the stimulus reaches the threshold. By analogy, imagine flushing a toilet: You need to press at least a certain strength (the threshold), but pressing harder does not make the toilet flush faster or more vigorously. Similarly, when you flick the switch to turn on the lights in your room, flicking the switch harder would not make the lights brighter.\n\nThe all-or-none law constrains how an axon can send a message. To signal the difference between a weak stimulus and a strong stimulus, all that an axon can change is the frequency of its action potentials, or their timing. By analogy, if you wanted to flick the lights in your room to send signals to someone outside, you could flick the switch frequently to mean one thing and flick it less often to mean something else. You could also flick the switch on and off at different rhythms.\n\nFlash-flash ... [long pause] ... flash-flash\n\nmight mean something different from\n\nFlash ... [pause] ... flash ... [pause] ... flash ... [pause] ... flash.\n\nThe nervous system uses both types of coding. For example, a taste axon shows one rhythm of responses for sweet tastes and a different rhythm for bitter tastes.\n\nThe Molecular Basis of the Action Potential\n\nThe chemical events behind the action potential make sense if you remember three principles:",
  "meta": {
    "char_count": 1780,
    "word_count": 293
  }
}