{
  "id": "1_Biological_Psychology_chunk_13",
  "book_id": "1_Biological_Psychology",
  "source_file": "Biological Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Biological Psychology.txt",
  "chunk_index": 13,
  "text": "venting AIDS, Alzheimer’s disease, Parkinson’s disease, stroke, and other disorders depends largely on animal research. In much of medicine and biological psychology, research would progress slowly or not at all without animals.\n\nDegrees of Opposition\n\nOpposition to animal research ranges in degree. “Minimalists” accept certain types of animal research but not others depending on the probable value of the research, the amount of distress to the animal, and the type of animal. Few people have serious qualms about hurting an insect, for example. They favor firm regulations on research. Researchers agree in principle, although they often differ in where they draw the line between acceptable and unacceptable research. Comparing probable harm to benefits is difficult, and research often fails to live up to the optimistic expectations.\n\nThe legal standard emphasizes “the three Rs”: reduction of animal numbers (using fewer animals), replacement (using computer models or other substitutes for animals, when possible), and refinement (modifying the procedures to reduce pain and discomfort). In the United States, every college or other institution that receives government research funds is required to have an Institutional Animal Care and Use Committee, composed of veterinarians, community representatives, and scientists that evaluate proposed experiments, decide whether they are acceptable, and specify procedures to minimize pain and discomfort. Similar regulations and committees govern research on human subjects. In addition, research laboratories must abide by national laws requiring standards of cleanliness and animal care. Scientific journals accept publications only after researchers state that they followed all the laws and regulations.",
  "meta": {
    "char_count": 1762,
    "word_count": 251
  }
}