{
  "id": "1_Biological_Psychology_chunk_16",
  "book_id": "1_Biological_Psychology",
  "source_file": "Biological Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Biological Psychology.txt",
  "chunk_index": 16,
  "text": "andalizing laboratories, placing a bomb under a professor’s car, placing a bomb on a porch (intended for a researcher but accidentally placed on the neighbor’s porch), banging on a researcher’s children’s windows at night, and inserting a garden hose through a researcher’s window to flood the house. Michael Conn and James Parker quote a spokesperson for the Animal Defense League as follows: “I don’t think you’d have to kill—assassinate—too many [doctors involved with animal testing]. . . . I think for 5 lives, 10 lives, 15 human lives, we could save a million, 2 million, 10 million nonhuman lives.” One researcher, Dario Ringach, finally agreed to stop his research on monkeys, if animal-rights extremists would stop harassing and threatening his children. He emailed them, “You win.” In addition to researchers who quit in the face of attacks, many colleges and other institutions have declined to open animal research laboratories because of their fear of violence.\n\nThe often fervent and extreme nature of the opposition makes it difficult for researchers to express intermediate or nuanced views. Many of them remark that they really do care about animals, despite using them for research. Some neuroscientists are vegetarians. But admitting to doubts seems almost like giving in to intimidation. The result is extreme polarization that interferes with open-minded contemplation of the difficult issues.\n\nWe began this chapter with a quote from the Nobel Prize-winning biologist Niko Tinbergen, who argued that no fundamental gulf separates humans from other animal species. Because we are similar in many ways to other species, we learn much about ourselves from animal studies. Also because of that similarity, we wish not to hurt them.",
  "meta": {
    "char_count": 1749,
    "word_count": 275
  }
}