{
  "id": "1_Biological_Psychology_chunk_25",
  "book_id": "1_Biological_Psychology",
  "source_file": "Biological Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Biological Psychology.txt",
  "chunk_index": 25,
  "text": "on is an afferent to the nervous system, and every motor neuron is an efferent from the nervous system. Within the nervous system, any neuron is an afferent from one structure and an efferent to another. You can remember that afferent starts with a as in admit, and efferent starts with e as in exit. If a cell’s dendrites and axon are entirely contained within a single structure, the cell is an interneuron or intrinsic neuron of the structure.\n\nVariations among Neurons\n\nNeurons vary enormously in size, shape, and function. The shape of a neuron determines its connections with other cells and thereby determines its function. The widely branching dendrites of the Purkinje cell in the cerebellum enable it to receive input from up to 200,000 other neurons. By contrast, the tiny bipolar neurons in the retina might receive input from as few as two other cells.\n\nGlia\n\nGlia (or neuroglia), the other components of the nervous system, perform many functions. The term glia, derived from a Greek word meaning “glue,” reflects early investigators’ idea that glia served a function like glue, to hold the neurons together. Although that concept is obsolete, the term remains. At one time, neuroscientists believed that glia greatly outnumbered neurons. According to later, more accurate measurements, neurons slightly outnumber glia. The ratio of neurons to glia varies from one brain area to another.\n\nThe brain has several types of glia. The star-shaped astrocytes wrap around the dendrites connecting to functionally related axons. A single astrocyte might surround the tips of a few hundred dendrites. By surrounding a connection between neurons, an astrocyte shields it from chemicals circulating in the surround.",
  "meta": {
    "char_count": 1718,
    "word_count": 275
  }
}