{
  "id": "1_Biological_Psychology_chunk_6",
  "book_id": "1_Biological_Psychology",
  "source_file": "Biological Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Biological Psychology.txt",
  "chunk_index": 6,
  "text": "time presumably does not know why. The next spring, when she lays an egg, sits on it, and defends it from predators, she doesn’t know why. Even humans don’t always know the reasons for their own behaviors. Yawning and laughter are two examples. You do them, but can you explain what they accomplish? Even when an intention is clear—for example, you are buying a sándwich because you plan to eat it—the intention does not explain anything. Something else, after all, caused the intention.\n\nIn contrast to commonsense explanations, biological explanations of behavior fall into four categories: physiological, ontogenetic, evolutionary, and functional (Tinbergen, 1951). A physiological explanation relates a behavior to the activity of the brain and other organs. It deals with the machinery of the body, for example, the chemical reactions that enable hormones to influence brain activity and the routes by which brain activity controls muscle contractions.\n\nThe term ontogenetic comes from Greek roots meaning the origin (or genesis) of being. An ontogenetic explanation describes how something develops. For example, if we want to explain why males and females differ on average in some \nregard, we might examine behavior at various ages and relate it to changes in the nervous system.\n\nAn evolutionary explanation reconstructs the evolutionary history of a structure or behavior. The characteristic features of an animal are almost always modifications of something found in ancestral species. For example, bat wings are modified arms, and porcupine quills are modified hairs. In behavior, monkeys use tools occasionally, and humans evolved elaborations on those abilities that enable us to use tools even better (Peeters et al., 2009).",
  "meta": {
    "char_count": 1739,
    "word_count": 268
  }
}