{
  "id": "1_Biological_Psychology_chunk_18",
  "book_id": "1_Biological_Psychology",
  "source_file": "Biological Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Biological Psychology.txt",
  "chunk_index": 18,
  "text": "of treatment have failed. The procedure is usually successful, and usually without any serious negative effects, but occasionally the person shows troublesome behavioral changes. When that happens, is the individual personally responsible for the misbehavior? Or is it the fault of the electrodes?\n\nYet another concern: Because most research has been done in North America or Europe, most studies of humans have used relatively prosperous people, mostly people of European ancestry, not a representative sample of all humanity. For some purposes, that is not a problem. Brain anatomy is the same for people throughout the world. The basic principles of neurons, synapses, and sensory organs are the same for all people, and in some respects almost the same for all mammals. Where diversity, or the lack of it, becomes a big issue is the effects of medications. Some medications affect people differently because of small changes in their genetics. Some medications affect females differently from males. Several pharmaceutical companies have faced complaints, even lawsuits, because they marketed a drug after testing it on only one type of person. One excuse for not using a broader sample has been researchers’ assumption that minority group members would refuse, because they knew about past cases of abuse. An especially shameful example was the Tuskegee study from 1932 to 1972, in which investigators knowingly failed to treat syphilis in Black men, just to observe how the disease progressed. However, researchers have found that minority group members are mostly willing to participate, if they are given proper explanations about the proposed research.\n\nModule 1.2 Neurons and Other Cells\n\nNeurons\n\nThe nervous system consists of two kinds of cells, neurons and glia.",
  "meta": {
    "char_count": 1776,
    "word_count": 276
  }
}