{
  "id": "1_Biological_Psychology_chunk_3",
  "book_id": "1_Biological_Psychology",
  "source_file": "Biological Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Biological Psychology.txt",
  "chunk_index": 3,
  "text": "lutionary, and developmental mechanisms of behavior and experience. It is approximately synonymous with the terms biopsychology, psychobiology, physiological psychology, and behavioral neuroscience. The term biological psychology emphasizes that the goal is to relate biology to issues of psychology. Neuroscience includes much that is relevant to behavior, but it includes more detail about anatomy and chemistry.\n\nBiological psychology is not only a field of study but also a point of view. It holds that we think and act as we do because of brain mechanisms, and that we evolved those brain mechanisms because ancient animals built this way survived and reproduced.\n\nBiological psychology deals with brain activity. Offers a view of the human brain from the top (what anatomists call a dorsal view) and from the bottom (a ventral view). The labels point to a few important areas that will become more familiar as you proceed through this text. An inspection of a brain reveals distinct subareas. At the microscopic level, we find two kinds of cells: the neurons and the glia. Neurons, which convey messages to one another and to muscles and glands, vary enormously in size, shape, and functions. The glia, generally smaller than neurons, have many functions but they do not convey information over great distances. The activities of neurons and glia somehow produce an enormous wealth of behavior and experience. This book is about researchers’ attempts to elaborate on that word somehow.\n\nThree Main Points to Remember\n\nThis book presents a great deal of factual information. Regardless of how many details you learn or forget, at least three general points should stick with you forever:\n\n1. Perception occurs in your brain.",
  "meta": {
    "char_count": 1729,
    "word_count": 274
  }
}