{
  "id": "1_Biological_Psychology_chunk_26",
  "book_id": "1_Biological_Psychology",
  "source_file": "Biological Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Biological Psychology.txt",
  "chunk_index": 26,
  "text": "everal types of glia. The star-shaped astrocytes wrap around the dendrites connecting to functionally related axons. A single astrocyte might surround the tips of a few hundred dendrites. By surrounding a connection between neurons, an astrocyte shields it from chemicals circulating in the surround. Also, by taking up the ions and transmitters released by axons and then releasing them back, an astrocyte helps synchronize closely related neurons, enabling their axons to send messages in waves. Astrocytes are therefore important for generating rhythms, such as your rhythm of breathing. Astrocytes also dilate the blood vessels to bring more nutrients into the most active brain areas.\n\nAccording to a popular hypothesis known as the tripartite synapse, the tip of an axon releases chemicals that cause the neighboring astrocyte to release its own chemicals, thus modifying the message to the next neuron. In some brain areas, astrocytes respond to hormones and thereby influence neurons. They also control the critical period for modification of the visual cortex early in life. In short, astrocytes are active partners of neurons.\n\nTiny cells called microglia act as part of the immune system, removing viruses and fungi from the brain. They proliferate after brain damage, removing dead or damaged neurons. Together with astrocytes, microglia prune ineffective synapses and adjust the effectiveness of others. Pruning the inappropriate synapses is an important process. Either too much pruning or too little pruning during early development leads to developmental disorders. Yet another function of microglia is to provide negative feedback to put the brakes on neuronal activity. A loss of microglia leads to seizures.",
  "meta": {
    "char_count": 1726,
    "word_count": 262
  }
}