{
  "id": "1_Biological_Psychology_chunk_22",
  "book_id": "1_Biological_Psychology",
  "source_file": "Biological Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Biological Psychology.txt",
  "chunk_index": 22,
  "text": "refully scaffolded by other molecules.\n\nCells also contain ribosomes, structures that synthesize new protein molecules. Some ribosomes float freely within the cell, but others attach to the endoplasmic reticulum, a network of thin tubes that transport newly synthesized proteins to other locations.\n\nA mitochondrion (plural: mitochondria) performs metabolic activities, providing the energy that the cell uses for all activities. For many years, neuroscientists and psychologists paid little attention to mitochondria, but later research has increased their interest. Mitochondria are not all the same. Mitochondria have their own genes, separate from those in the nucleus of a cell. Mitochondria are inherited in the cytoplasm of the egg cell. Therefore, you inherited your mitochondria from your biological mother, who got them from her mother, and so on. \n\nBecause brain activity requires more energy than the activity of any other organ, the brain is especially dependent on good mitochondrial functioning. Healthy mitochondria promote health, brain activity, and cognition. Mitochondria can be less active than average either because of genes within the mitochondria themselves or because of toxic chemicals, stress, or illnesses that produce inflammation. Decreased mitochondrial function means decreased mental energy and a high probability of depression. Impairments of mitochondria have also been linked to increased severity of epilepsy, Alzheimer’s disease, Parkinson’s disease, and Huntington’s disease.\n\nThe Structure of Neurons\n\nCompared to other cells, the most distinctive feature of neurons is their highly variable shape. All neurons include a soma (cell body), and most also have dendrites, an axon, and presynaptic terminals.",
  "meta": {
    "char_count": 1745,
    "word_count": 249
  }
}