{
  "id": "1_Biological_Psychology_chunk_2",
  "book_id": "1_Biological_Psychology",
  "source_file": "Biological Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Biological Psychology.txt",
  "chunk_index": 2,
  "text": "beyond the reach of empirical science. Another possibility is that other universes exist, and we know about only the one in which life like ours could evolve. Physicists have persuasive theoretical reasons for supposing other universes, but that idea also goesbeyond the reach of empirical science.\n\nI said that two questions stand out as the most profound. The second one is this: In a universe composed of matter and energy, why is there such a thing as consciousness? In our universe, consciousness exists. It did not have to be so. Computers can perform increasingly intelligent operations, presumably without being conscious, but when we perform the same operations, conscious experience accompanies them. Why? The mind-brain problem or the mind-body problem is the question of how and why certain types of brain activity are conscious. We shall deal with this question in more detail in a later chapter.\n\nThe Field of Biological Psychology \n\nIn a sense, all psychology is biological. You are a biological organism, and everything that you do is part of your biology. However, it is helpful to distinguish among levels of explanation. Some aspects of psychology are best described in terms of cultural, social, and cognitive influences, while others require reference to genetics, evolution, hormones, body physiology, and brain mechanisms.\n\nBiological psychology is the study of the physiological, evolutionary, and developmental mechanisms of behavior and experience. It is approximately synonymous with the terms biopsychology, psychobiology, physiological psychology, and behavioral neuroscience. The term biological psychology emphasizes that the goal is to relate biology to issues of psychology.",
  "meta": {
    "char_count": 1707,
    "word_count": 257
  }
}