{
  "id": "1_Biological_Psychology_chunk_33",
  "book_id": "1_Biological_Psychology",
  "source_file": "Biological Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Biological Psychology.txt",
  "chunk_index": 33,
  "text": "om less than 1 meter/second to more than 100 m/s), a touch on your shoulder reaches your brain sooner than does a touch on your toes. The difference is small and generally unimportant.\n\nIn vision, however, your brain needs to know whether one stimulus began even slightly before or after another one. If light moves from point A on your retina to point B, then the input from A will reach your brain slightly before the input from B, and that difference tells you that something moved from A to B. But what if point A or B on the retina is slightly closer to the brain? If so, its input would reach the brain first, even if A and B were stimulated at the same time. To detect movement as accurately as possible, your visual system has the axons from more distant spots of the eye transmit slightly faster. If input from two parts of the eye start at the same time, they reach the brain at the same time, even if one part is slightly closer to the brain.\n\nIn short, the properties of impulse conduction in an axon are amazingly well adapted to your needs. Let’s examine the mechanics of impulse transmission.\n\nThe Resting Potential of the Neuron\n\nFirst, we need to consider the resting potential—the difference in electrical charge between the inside and the outside of a neuron. All parts of a neuron are covered by a membrane about 8 nanometers (nm) thick. That is about one ten-thousandth the width of a human hair. The membrane is composed of two layers of phospholipid molecules (chains of fatty acids linked to a phosphate group). Embedded among the phospholipids are cylindrical proteins that let certain chemicals pass.\n\nWhen at rest, the membrane maintains an electrical gradient, also known as polarization—a difference in electrical charge between the inside and outside of the cell.",
  "meta": {
    "char_count": 1793,
    "word_count": 314
  }
}