{
  "id": "1_Biological_Psychology_chunk_21",
  "book_id": "1_Biological_Psychology",
  "source_file": "Biological Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Biological Psychology.txt",
  "chunk_index": 21,
  "text": "remain separate instead of merging into one another. A small gap separates the tip of a neuron’s fiber from the surface of the next neuron. The brain, like the rest of the body, does indeed consist of individual cells.\n\nIn 1906, Cajal and Golgi shared the 1906 Nobel Prize for Physiology or Medicine. Cajal used his acceptance speech to outline the cellular basis of the brain. In spite of Cajal’s evidence, which had persuaded almost everyone else, Golgi continued to defend the theory that all nerve cells merge directly into one another. It was the only time in history when those who shared a Nobel prize used the occasion to give acceptance speeches that contradicted each other.\n\nThe Structures of an Animal Cell\n\nNeurons have much in common with the rest of the body’s cells. The surface of a cell is its membrane (or plasma membrane), a structure that separates the inside of the cell from the outside environment. Most chemicals cannot cross the membrane, but protein channels in the membrane permit a controlled Flow of water, oxygen, sodium, potassium, calcium, chloride, and other important chemicals.\n\nExcept for mammalian red blood cells, all animal cells have a nucleus, the structure that contains the chromosomes. The chromosomes do not just float around loosely. DNA, the chemical that forms the chromosomes, is not stable for long in water solution. The DNA and other key chemicals are carefully scaffolded by other molecules.\n\nCells also contain ribosomes, structures that synthesize new protein molecules. Some ribosomes float freely within the cell, but others attach to the endoplasmic reticulum, a network of thin tubes that transport newly synthesized proteins to other locations.",
  "meta": {
    "char_count": 1705,
    "word_count": 276
  }
}