{
  "id": "1_Cognitive_Psychology_chunk_2",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 2,
  "text": "bottom line is that understanding cognitive psy \nchology can help us understand much of what goes on in our everyday lives. \nThis chapter introduces the field of cognitive psychology. It describes some of the \nintellectual history of the study of human thinking. It particularly emphasizes some of \nthe issues and concerns that arise when we think about how people think. Next is a brief \noverview of the major methods, issues, and content areas of cognitive psychology. \nThe ideas presented in this chapter will provide a foundation on which to build \nan understanding of the topics in cognitive psychology. \nWhy study the history of this field, or of any other field, for that matter? For one \nthing, if we know where we came from, we may have a better understanding of where \nwe are heading. For another, we may learn from past mistakes. In this way, when we \nmake mistakes they will be fresh, new mistakes and not the same old ones. Our ways \nof addressing fundamental issues have changed. But some of the fundamental questions remain much the same. Ultimately, we may learn something about how people \nthink by studying how people have thought about thinking. \nThe progression of ideas often involves a dialectic. A dialectic is a developmental \nprocess whereby ideas evolve over time through a pattern of transformation. What is \nthis pattern? In a dialectic: \n A thesis is proposed. A thesis is a statement of belief. For example, some people \nbelieve that human nature governs many aspects of human behavior. After a while, however, certain \nindividuals notice apparent flaws in the thesis. \n Eventually, or perhaps even quite soon, an antithesis emerges. An antithesis is \na statement that counters a previous statement of belief. For example, an alter",
  "meta": {
    "char_count": 1761,
    "word_count": 289
  }
}