{
  "id": "1_Cognitive_Psychology_chunk_6",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 6,
  "text": "n mind. He believed that there are no innate ideas whatsoever. In the eighteenth century, German philosopher Immanuel Kant dialectically synthesized the views of Descartes and Locke, arguing that both rationalism and empiricism have their place. Both must work together in the quest for truth. Most \npsychologists today accept Kant's synthesis. \n\n\n\nPsychological Antecedents of Cognitive Psychology \nEarly Dialectics in the Psychology of Cognition \nStructuralism \nAn early dialectic in the history of psychology is that between structuralism and \nfunctionalism. Structuralism was the first major \nschool of thought in psychology. Structuralism seeks to understand the structure \n(configuration of elements) of the mind and its perceptions by analyzing those perceptions into their constituent components. Consider, for example, the perception of \na flower. Structuralists would analyze this perception in terms of the constituent colors, geometric forms, size relations, and so on. \nA German psychologist whose ideas later would contribute to the development \nof structuralism was Wilhelm Wundt. Wundt is often viewed as the \nfounder of experimental psychology. Wundt used a variety of methods in his research. \nOne of these methods was introspection. Introspection is a looking inward at pieces \nof information passing through consciousness. An example is the sensations experienced when looking at a flower. In effect, we analyze our own perceptions. Wundt \nadvocated the study of sensory experiences through introspection. \nWundt had many followers. One was an American student, Edward Titchener. Titchener helped bring structuralism to the United States. \nOther early psychologists criticized both the method (introspection) and the focus \n(elementary structures of sensation) of structuralism.",
  "meta": {
    "char_count": 1798,
    "word_count": 253
  }
}