{
  "id": "1_Cognitive_Psychology_chunk_58",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 58,
  "text": "ediate applications. For example, a basic finding from research on learn \ning and memory is that learning is superior when it is spaced out over time \nrather than crammed into a short time interval. This basic finding has an \nimmediate application to study strategies. At the same time, research on \neyewitness testimony, which seems on its face to be very applied, has en \nhanced our basic understanding of memory systems and of the extent to \nwhich humans construct their own memories. It does not merely reproduce \nwhat happens in the environment. \nBefore closing this chapter, think about some of the fields of cognitive \npsychology, described in the remaining chapters, to which these key themes \nand issues may apply. \n\nCognitive psychologists have been involved in studying a wide range of psychological \nphenomena. This range includes not only perception, learning, memory, and think \ning but also seemingly less cognitively oriented phenomena, such as emotion and \nmotivation. In fact, almost any topic of psychological interest may be studied from a \ncognitive perspective. Nonetheless, there are some main areas of interest to cognitive \npsychologists. In this textbook we attempt to describe some of the preliminary an \nswers to questions asked by researchers in the main areas of interest. \n What is cognitive psychology? \nCognitive psychology is the study of how people perceive, \nlearn, remember, and think about information. \nHow did psychology develop as a science? \nBeginning with Plato and Aristotle, people have \ncontemplated how to gain understanding of the \ntruth. Plato held that rationalism offers the clear \npath to truth, whereas Aristotle espoused empiricism as the route to knowledge. Centuries later, \nDescartes extended Plato's rationalism, whereas",
  "meta": {
    "char_count": 1778,
    "word_count": 271
  }
}