{
  "id": "1_Cognitive_Psychology_chunk_49",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 49,
  "text": ". Some of these \nquestions go to the very core of the nature of the human mind. \nUnderlying Themes in the Study of Cognitive Psychology \nIf we review the important ideas in this chapter, we discover some of the major \nthemes that underlie all of cognitive psychology. What are some of these themes? \nHere are seven of them, viewed dialectically: \n\nNature versus nurture: \nThesis/Antithesis: Which is more influential in human cogmtlOn \nnature or nurture ? If we believe that innate characteristics of human \ncognition are more important, we might focus our research on studying \ninnate characteristics of cognition. If we believe that the environment \nplays an important role in cognition, we might conduct research ex \nploring how distinctive characteristics of the environment seem to in \nfluence cognition. \nSynthesis: How can we learn about co-variations and interactions in the \nenvironment, such as how an impoverished environment adversely af \nfects someone whose genes otherwise might have led to success in a va \nriety of tasks? \n\nRationalism versus empiricism: \nThesis/Antithesis: How should we discover the truth about ourselves and \nabout the world around us? Should we do so by trying to reason logically, \nbased on what we already know? Or should we do so by observing and test \ning our observations of what we can perceive through our senses? \nSynthesis: How can we combine theory with empirical methods to learn \nthe most we can about cognitive phenomena? \n\nStructures versus processes: \nThesis/Antithesis: Should we study the structures (contents, attributes, and \nproducts) of the human mind? Or should we focus on the processes of hu \nman thinking? \nSynthesis: How do mental processes operate on mental structures? \n\nDomain generality versus domain specificity:",
  "meta": {
    "char_count": 1780,
    "word_count": 276
  }
}