{
  "id": "1_Cognitive_Psychology_chunk_9",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 9,
  "text": "ing this material to other courses or \nactivities you participate in. For example, you may be called on to explain to a friend \nhow to use a new computer program. A good way to start would be to ask that person \nif he or she has any questions. That way, the information you provide is more directly \nuseful to your friend, rather than forcing this individual to search for the information \nhe or she needs in a long, one-sided lecture. \n\nAssociationism: An Integrative Synthesis \nAssociationism, like functionalism, was less a rigid school of psychology than an influential way of thinking. Associationism examines how events or ideas can become \nassociated with one another in the mind to result in a form of learning. For example, \nassociations may result from contiguity (associating things that tend to occur together \nat about the same time), similarity (associating things with similar features or proper \nties), or contrast (associating things that seem to show polarities, such as hot/cold, \nlight/dark, day/night). \nIn the late 1800s, associationist Hermann Ebbinghaus was the first \nexperimenter to apply associationist principles systematically. Specifically, Ebbinghaus \nstudied his own mental processes. He counted his errors and recorded his response \ntimes. Through his self-observations, Ebbinghaus studied how people learn and remember material through rehearsal. Rehearsal is the conscious repetition of to-be-Iearned \nmaterial. Among other findings, he found that frequent repetition can fix mental as \nsociations more firmly in memory. Thus, repetition aids in learning \nAnother influential associationist, Edward Lee Thorndike, held \nthat the role of \"satisfaction\" is the key to forming associations. Thorndike termed \nthis principle the law of effect63..",
  "meta": {
    "char_count": 1777,
    "word_count": 265
  }
}