{
  "id": "1_Cognitive_Psychology_chunk_57",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 57,
  "text": "chologists need to learn a variety of different kinds of tech \nniques to do their job well. All these methods, however, must be scientific. \nScientific methods differ from other methods in that they provide the basis \nfor the self-correcting nature of science. Eventually we correct our errors. The \nreason is that scientific methods enable us to disconfirm our expectations \nwhen those expectations are wrong. Nonscientific methods do not have this \nfeature. For example, methods of inquiry that simply rely on faith or authority \nto determine truth may have value in our lives. But they are not scientific and \nhence are not self-correcting. Indeed, the words of one authority may be re \nplaced by the words of another authority tomorrow without anything new \nbeing learned about the phenomenon to which the words apply. As the world \nlearned long ago, important dignitaries stating that the Earth is at the center \nof the universe do not make it so.\n \nAll basic research in cognitive psychology may lead to applications, and all ap \nplied research may lead to basic understandings:\nPoliticians, and sometimes even scientists, like to draw tidy distinctions \nbetween basic and applied research. But the truth is, the distinction often is \nnot clear at all. Research that seems like it will be basic often leads to im \nmediate applications. Similarly, research that seems like it will be applied \nsometimes leads quickly to basic understandings, whether or not there are \nimmediate applications. For example, a basic finding from research on learn \ning and memory is that learning is superior when it is spaced out over time \nrather than crammed into a short time interval. This basic finding has an \nimmediate application to study strategies. At the same time, research on",
  "meta": {
    "char_count": 1774,
    "word_count": 287
  }
}