{
  "id": "1_Cognitive_Psychology_chunk_23",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 23,
  "text": "ead to everyday applications. For each of these purposes, \ndifferent research methods offer differing advantages and disadvantages. \n\nCHUNKY EXPERTS WHO \nDIVIDE TO CONQUER \nGrowing up as a boy in small \ntown Ohio, I devoted hundreds \nof hours to playing baseball. My \noldest coach, Dean Harrah, had \nthe most prodigious memory for \nbaseball games of anyone I ever \nknew. Dean could recall every significant play of a \ngame, such as the inning, number of outs, pitch \ncount, batter, and location of fielders as he flashed \nevery hit-and-run sign in a game played 3 weeks ago. \nHis recall of game details was just staggering. Yet he \nwas notorious for forgetting most other things, such as \nhis appointments, grocery shopping, and his wife's \norders. I also had an amazing friend, Claude, a \"chess \nfreak,\" who played masterful chess and could remember, move by move, games he'd played several days \nbefore. Yet Claude couldn't remember worth beans \nschool subjects like the periodic table for our chemistry class. Dean and Claude couldn't tell me a thing \nabout how they did it, just that they \"saw\" significant \nevents in their entirety as a game unfolded. Such \nprodigious memories, residing in the same head along \nside such lousy memories, always fascinated me. It was \none of the many puzzles of everyday life that got me \ninterested in the psychology of human memory. \nThe puzzlement only deepened when academic \npsychologists told me just how limited everybody's \nmemory usually is. Specifically, we are all severely limited in how many things we can take in and hold even \nbriefly in memory, and consequently in how quickly we \ncan put new information into a more permanent \nmemory. But what are these \"things\" we take in? The \npsychologist George Miller called them \"chunks",
  "meta": {
    "char_count": 1781,
    "word_count": 291
  }
}