{
  "id": "1_Cognitive_Psychology_chunk_34",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 34,
  "text": "ronments).\nWeaknesses:\nLimitations imposed by hardware (computer circuitry) and software (programs written by researchers).\nDistinctions between human intelligence and machine intelligence.\nEven with sophisticated modeling, simulations may imperfectly model the way the human brain thinks.\nExamples:\nSimulations: David Marr attempted to simulate human visual perception and proposed a theory of visual perception based on his computer models.\nAI: Various AI programs have been written that can demonstrate expertise (playing chess), but they probably do so via different processes from those used by human experts.\n\nExperiments on Human Behavior \nIn controlled experimental designs, an experimenter conducts research, typically in a \nlaboratory setting. The experimenter controls as many aspects of the experimental \nsituation as possible. There are basically two kinds of variables in any given experiment. Independent variables are aspects of an investigation that are individually \nmanipulated, or carefully regulated, by the experimenter, while other aspects of the \ninvestigation are held constant (not subject to variation). Dependent variables \nare outcome responses, the values of which depend on how one or more independent \nvariables influence or affect the participants in the experiment. When you tell some \nstudent research participants that they will do very well on a task, but you do not say \nanything to other participants, the independent variable is the amount of information that the students are given about their expected task performance. The dependent variable is how well both groups actually perform the task-that is, their score \non the math test. \nWhen the experimenter manipulates the independent variables, he or she con",
  "meta": {
    "char_count": 1750,
    "word_count": 252
  }
}