{
  "id": "1_Cognitive_Psychology_chunk_31",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 31,
  "text": "ent of long-term memory, but persons with lesions in the right parietal lobe show the opposite pattern:\nthemes+ in the brain show relatively normal short-term memory but grave deficits in long-term memory.\n\nMETHOD: SELF-REPORTS, SUCH AS VERBAL PROTOCOLS, SELF-RATINGS, DIARIES\nDescription of method:\nObtain participants’ reports of own cognition in progress or as recollected.\nValidity of causal inferences: random assignment of subjects:\nNot applicable.\nValidity of causal inferences: experimental control of independent variables:\nProbably not.\nSamples: size:\nProbably small.\nSamples: representativeness:\nMay be representative.\nEcological validity:\nMaybe; see strengths and weaknesses.\nInformation about individual differences:\nYes.\nStrengths:\nAccess to introspective insights from participants’ point of view, which may be unavailable via other means.\nWeaknesses\nInability to report on processes occurring outside conscious awareness;\nVerbal protocols & self-ratings: Data gathering may influence cognitive processes being reported;\nRecollections: Possible discrepancies between real-time cognition and recollected cognitive processes and products.\nExamples:\nIn a study of mental imagery, Stephen Kosslyn and his colleagues asked subjects to keep a week-long diary recording all their mental images in each sensory modality.\n\nMETHOD: CASE STUDIES\nDescription of method:\nEngage in intensive study of single individuals, drawing general conclusions about behavior.\nValidity of causal inferences: random assignment:\nHighly unlikely.\nValidity of causal inferences: experimental control:\nHighly unlikely.\nSamples: size:\nAlmost certain to be small.\nSamples: representativeness:\nNot likely to be representative.\nEcological validity:",
  "meta": {
    "char_count": 1728,
    "word_count": 225
  }
}