{
  "id": "1_Cognitive_Psychology_chunk_38",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 38,
  "text": "pose the participants in the treatment \ncondition showed poorer performance at a statistically significant level than the \nparticipants in the control condition. We then might infer that loud distracting \nnoises did, indeed, influence the ability to perform well on this particular cognitive \ntask. \nIn cognitive-psychological research, the dependent variables may be quite di \nverse. But they often involve various outcome measures of accuracy (e.g., frequency \nof errors) , of response times, or of both. Among the myriad possibilities for independent variables are characteristics of the situation, of the task, or of the participants. For example, characteristics of the situation may involve the presence versus \nthe absence of particular stimuli or hints during a problem-solving task. Characteristics of the task may involve reading versus listening to a series of words and then \nresponding to comprehension questions. Characteristics of the participants may \ninclude age differences, differences in educational status, or differences based on \ntest scores. \nOn the one hand, characteristics of the situation or task may be manipulated \nthrough random assignment of participants to either the treatment or the control \ngroup. On the other hand, characteristics of the participant are not easily manipulated experimentally. For example, suppose the experimenter wants to study the effects of aging on speed and accuracy of problem solving. The researcher cannot randomly assign participants to various age groups because people's ages cannot be \nmanipulated (although participants of various age groups can be assigned at random \nto various experimental conditions). In such situations researchers often use other \nkinds of studies.",
  "meta": {
    "char_count": 1739,
    "word_count": 252
  }
}