{
  "id": "1_Cognitive_Psychology_chunk_18",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 18,
  "text": "at use in advertising. John Watson, \nafter he left Johns Hopkins University as a professor, became an extremely successful \nexecutive in an advertising firm and used his knowledge of psychology to reach his success. Indeed, much of advertising has directly used principles from cognitive psychology \nto attract customers to products, sometimes dubious and sometimes not. \nBy the early 1960s developments in psychobiology, linguistics, anthropology, and \nartificial intelligence, as well as the reactions against behaviorism by many mainstream \npsychologists, converged to create an atmosphere ripe for revolution. Early cognitivists argued that \ntraditional behaviorist accounts of behavior were inadequate precisely because they said \nnothing about how people think. One of the most famous early articles in cognitive \npsychology was, oddly enough, on \"the magic number seven.\" George Miller \nnoted that the number seven appeared in many different places in cognitive psychology, \nsuch as in the literatures on perception and memory, and he wondered whether there was \nsome hidden meaning in its frequent reappearance. For example, he found that most \npeople can remember about seven items of information. In this work, Miller also intro \nduced the concept of channel capacity, the upper limit with which an observer can match \na response to information given to him or her. For example, if you can remember seven \ndigits presented to you sequentially, your channel capacity for remembering digits is \nseven. Ulric Neisser's book Cognitive Psychology was especially critical in \nhringing cognitivism to prominence by informing undergraduates, graduate students, and \nacademics about the newly developing field. Neisser defined cognitive psychology as the",
  "meta": {
    "char_count": 1755,
    "word_count": 256
  }
}