{
  "id": "1_Cognitive_Psychology_chunk_51",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 51,
  "text": "ly so that \nbasic research leads to applied research, which leads to further basic re \nsearch, and so on? \n\nBiological versus behavioral methods: \nThesis/Antithesis: Should we study the brain and its functioning directly, \nperhaps even scanning the brain while people are performing cognitive \ntasks? Or should we study people's behavior in cognitive tasks, looking at \nmeasures such as percentage correct and reaction time? \nSynthesis: How can biological and behavioral methods be synthesized \nso that we understand cognitive phenomena at multiple levels of analysis? \n\nNote that these questions can be posed in the \"either/or\" form of thesis/antithesis, or \nin the both/and form of a synthesis of views or methods, which often proves more useful \nthan one extreme position or another. For example, our nature may provide an inherited \nframework for our distinctive characteristics and patterns of thinking and acting. But our \nnurture may shape the specific ways in which we flesh out that framework. We may use \nempirical methods for gathering data and for testing hypotheses. But we may use rationalist methods for interpreting data, constructing theories, and formulating hypotheses based \non theories. Our understanding of cognition deepens when we consider both basic re \nsearch into fundamental cognitive processes and applied research regarding effective uses \nof cognition in real-world settings. Syntheses constantly are evolving. What today may be \nviewed as a synthesis may tomorrow be viewed as an extreme position or vice versa. \n\nKey Ideas in Cognitive Psychology \nCertain key ideas seem to keep emerging in cognitive psychology, regardless of the particular phenomenon one studies. Here are what might be considered five major ideas.",
  "meta": {
    "char_count": 1750,
    "word_count": 263
  }
}