{
  "id": "1_Cognitive_Psychology_chunk_45",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 45,
  "text": "red by the act of giving the report (processes involving brief forms of memory) . As another example, cognitive processes may occur outside of conscious awareness (processes that do not require conscious attention or that take \nplace so rapidly that we fail to notice them. To get an idea of some of\nthe difficulties with self-reports, carry out the following \"Investigating Cognitive \nPsychology\" tasks. Reflect on your experiences with self-reports. \n\nAsk half of your friends individually one of the following series of questions and \nthe other half the other series. Ask them to respond as quickly as they can. \nSet 1 : \nWhat do silkworms weave? \nWhat is a popular material for clothing that comes from silkworms? \nWhat do cows drink? \nSet 2: \nWhat do bees make? \nWhat grows in fields that eventually is made into material for clothing? \nWhat do cows drink? \nFor many of your friends, when they get to question 3 in set 1 , they will say \"milk\" \nwhen we all know that cows drink water. Most of your friends responding to set 2 will \nsay \"water,\" not \"milk.\" You have just conducted an experiment. The experimental \nmethod divides people into two equal groups, changes one aspect between the two \ngroups (in your case, you asked a series of questions before asking the critical question), then measures the difference between the two groups. The number of mistakes \nis what you are measuring, and it is likely that your friends in group 1 will make more \nmistakes than your friends in group 2 because they have established the wrong set of \nexpectations for answering the question. \nCase studies (the study of exceptionally gifted individuals) and naturalistic \nobservations (the observation of individuals operating in nuclear power plants)",
  "meta": {
    "char_count": 1744,
    "word_count": 289
  }
}