{
  "id": "1_Cognitive_Psychology_chunk_36",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 36,
  "text": "ontrol conditions. If those requisites for the \nexperimental method are fulfilled, the experimenter may be able to infer probable \ncausality. This inference is of the effects of the independent variable or variables (the \ntreatment) on the dependent variable (the outcome) for the given population. \nMany different dependent variables are used in cognitive-psychological research. \nTwo common ones are percent correct (or its additive inverse, error rate) and reaction \ntime. It is important to choose both kinds of variables with great care, because no \nmatter what processes one is observing, what one can learn from an experiment will \ndepend almost exclusively on the variables one chooses to isolate from the often \ncomplex behavior one is observing. \nPsychologists who study cognitive processes with reaction time often use the sub \ntraction method, which involves estimating the time a cognitive process takes by subtracting the amow1t of time information processing takes with the process from the \ntime it takes without the process. For example, if you are asked \nto scan the words dog, cat, mouse, hamster, chipmunk and to say whether the word chipmunk appears in it, and then are asked to scan dog, cat, mouse, hamster, chipmunk, lion, \nand to say whether lion appears, the difference in the reaction times might be taken \nroughly to indicate the amount of time it takes to process each stimulus. \nSuppose the outcomes in the treatment condition show a statistically significant \ndifference from the outcomes in the control condition. The experimenter then can \ninfer the likelihood of a causal link between the independent variable or variables and the \ndependent variable. Because the researcher can establish a likely causal link between",
  "meta": {
    "char_count": 1751,
    "word_count": 272
  }
}