{
  "id": "1_Cognitive_Psychology_chunk_14",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 14,
  "text": "lt psychologists may be among the most avid. \nGestalt psychology states that we best understand psychological phenomena when we \nview them as organized, structured wholes. According to this view, we cannot fully understand behavior when we only break phenomena down into smaller parts. For example, \nbehaviorists tend to study problem solving by looking for subvocal processing, they are \nlooking for the observable behavior through which problem solving can be understood. \nGestaltists, in contrast, study insight, seeking to understand the unobservable mental \nevent by which someone goes from having no idea about how to solve a problem to \nunderstanding it fully in what seems a mere moment of time. \nThe maxim \"the whole differs from the sum of its parts\" aptly sums up the Gestalt \nperspective. To understand the perception of a flower, for example, we would have to \ntake into account the whole of the experience. We could not understand such a perception merely in terms of a description of forms, colors, sizes, and so on. Similarly, as \nnoted in the previous paragraph, we could not understand problem solving merely by \nlooking at minute elements of observable behavior. \nEmergence of Cognitive Psychology \nA more recent approach is cognitivism, the belief that much of human behavior can \nbe understood in terms of how people think. Cognitivism is, in part, a synthesis of \nearlier forms of analysis, such as behaviorism and Gestaltism. Like Gestaltism, it emphasizes internal mental processes. But like behaviorism, it has come to use precise \nquantitative analysis to study how people learn and think. \nEarly Role of Psychobiology \nIronically, one of Watson's former students, Karl Spencer Lashley, \nbrashly challenged the behaviorist view that the human brain is a passive organ",
  "meta": {
    "char_count": 1793,
    "word_count": 281
  }
}