{
  "id": "1_Cognitive_Psychology_chunk_28",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 28,
  "text": "his benefit of \nvery specific practice explains how expert memory in \none domain, such as baseball for Dean or chess for \nClaude, can easily co-exist alongside poor memory in \nunrelated domains such as their daily appointments or \nchemistry lessons. \nThe value of consistent chunking applies to \"re \nproductive learning,\" when we are trying to repro \nduce an arbitrary collection of items. Such learning is \noften required of us. In contrast, for mastery learning \nof conceptually richer domains, there are advantages \nof inter-relating groupings in cross-cutting classifications. For example, although constant groupings of \nfacts about political, economic, and military categories may aid a student's recalling facts about the \nAmerican Civil War, further understanding and \nmemory likely would come by inter-relating and \ninter-associating facts across domains-for example, \nnoting the political objectives served by a military \ncampaign, such as General Sherman's famous \"March \nto the Sea\" through the southern states. The benefit \nof such conceptual inter-relations is a much-studied \nropic, but more on that later. \n\nDistinctive Research Methods \nCognitive psychologists use various methods to explore how humans think. These \nmethods include: laboratory or other controlled experiments, psychobiological \nresearch, self-reports, case studies, naturalistic observation, and computer simulations and artificial intelligence.\nResearch Methods \nCognitive psychologists use controlled experiments, psychobiological research, self-reports, case studies, naturalistic observation, and computer simulations and artificial intelligence when studying cognitive phenomena. \n\nMETHOD: CONTROLLED LABORATORY EXPERIMENTS\nDescription of method:\nObtain samples of performance at a particular time and place.",
  "meta": {
    "char_count": 1798,
    "word_count": 237
  }
}