{
  "id": "1_Cognitive_Psychology_chunk_43",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 43,
  "text": "of her imprisonment, Genie had severe physical impairments and no language skills. Through case-study methods, information was collected about how she later began to learn language. It would have been unethical experimentally to deny \na person any language experience for the first 1 3 years of life. Therefore, case-study \nmethods are the only reasonable way to examine the results of someone's being \ndenied language and social exposure. \nSimilarly, traumatic brain injury cannot be manipulated in humans in the labora \ntory. Therefore, when traumatic brain injury occurs, case studies are the only way to \ngather information. For example, consider the case of Phineas Gage, a railroad worker \nwho, in 1 848, had a large metal spike driven through his frontal lobes in a freak accident. Surprisingly, Mr. Gage survived. His behavior \nand mental processes were drastically changed by the accident, however. Obviously, \nwe cannot insert large metal rods into the brains of experimental participants. There \nfore, in the case of traumatic brain injury we must rely on case-study methods to \ngather information. \nThe reliability of data based on various kinds of self-reports depends on the \ncandor of the participants when providing the reports. A participant may misreport \ninformation about his or her cognitive processes for a variety of reasons. These \nreasons can be intentional or unintentional. Intentional misreports can include \ntrying to edit out unflattering information. Unintentional misreports may involve \nnot understanding the question or not remembering the information accurately. For \nexample, when a participant is asked about the problem-solving strategies he or she \nused in high school, the participant may not remember. The participant may try to",
  "meta": {
    "char_count": 1769,
    "word_count": 267
  }
}