{
  "id": "1_Cognitive_Psychology_chunk_59",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 59,
  "text": "e? \nBeginning with Plato and Aristotle, people have \ncontemplated how to gain understanding of the \ntruth. Plato held that rationalism offers the clear \npath to truth, whereas Aristotle espoused empiricism as the route to knowledge. Centuries later, \nDescartes extended Plato's rationalism, whereas \nLocke elaborated on Aristotle's empiricism. Kant \noffered a synthesis of these apparent opposites. \nDecades after Kant proposed his synthesis, Hegel \nobserved how the history of ideas seems to progress through a dialectical process. \nHow did cognitive psychology develop from \npsychology? \nBy the twentieth century, psychology had emerged as a distinct field of study. Wundt \nfocused on the structures of the mind (leading to \nstructuralism), whereas James and Dewey focused \non the processes of the mind (functionalism) . \nEmerging from this dialectic was association \nism, espoused by Ebbinghaus and Thorndike. It \npaved the way for behaviorism by underscoring \nthe importance of mental associations. Another \nstep toward behaviorism was Pavlov's discovery of \nthe principles of classical conditioning. Watson \nand later Skinner were the chief proponents of \nbehaviorism. It focused entirely on observable \nlinks between an organism's behavior and particular environmental contingencies that strengthen \nor weaken the likelihood that particular behaviors will be repeated. Most behaviorists dismissed \nentirely the notion that there is merit in psychologists' trying to understand what is going on \nin the mind of the individual engaging in the \nbehavior. \nHowever, Tolman and subsequent behaviorist \nresearchers noted the role of cognitive processes \nin influencing behavior. A convergence of developments across many fields led to the emergence",
  "meta": {
    "char_count": 1748,
    "word_count": 248
  }
}