{
  "id": "1_Cognitive_Psychology_chunk_19",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 19,
  "text": "r channel capacity for remembering digits is \nseven. Ulric Neisser's book Cognitive Psychology was especially critical in \nhringing cognitivism to prominence by informing undergraduates, graduate students, and \nacademics about the newly developing field. Neisser defined cognitive psychology as the \nstudy of how people learn, structure, store, and use knowledge. Subsequently, Allen \nNewell and Herbert Simon proposed detailed models of human thinking and \nproblem solving from the most basic levels to the most complex. By the 1 970s cognitive \npsychology was recognized widely as a major field of psychological study, with a distinctive set of research methods. \nIn the 1970s, Jerry Fodor popularized the concept of the modularity of \nmind. He argued that the mind has distinct modules, or special-purpose systems, to \ndeal with linguistic and possibly other kinds of information. Modularity implies that \nthe processes that are used in one domain of processing, such as the linguistic or the perceptual, operate independently of processes in other \ndomains. An opposing view would be one of domain-general processing, according to \nwhich the processes that apply in one domain, such as perception or language, apply \nin many other domains as well. Modular approaches are useful in studying some cognitive phenomena, such as language, but have proven less useful in studying other \nphenomena, such as intelligence, which seems to draw upon many different areas of \nthe brain in complex interrelationships. \nCuriously, the idea of the mind as modular goes back at least to phrenologist \nFranz-Joseph Gall, who in the late eighteenth century believed \nthat the pattern of bumps and swells on the skull was directly associated with one's \npattern of cognitive skills.",
  "meta": {
    "char_count": 1767,
    "word_count": 268
  }
}