{
  "id": "1_Cognitive_Psychology_chunk_11",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 11,
  "text": "hough perhaps lacking any \nconscious thought, as in Thorndike's work). Others studied responses that were involuntarily triggered, in response to what appear to be unrelated external events. \nIn Russia, Nobel Prize-winning physiologist Ivan Pavlov studied \ninvoluntary learning behavior of this sort. He began with the observation that dogs \nsalivated in response to the sight of the lab technician who fed them. This response \noccurred before the dogs even saw whether the technician had food. To Pavlov, this \nresponse indicated a form of learning, classically conditioned learning, over which \nthe dogs had no conscious control. In the dogs' minds, some type of involuntary \nlearning linked the technician to the food. Pavlov's landmark work \npaved the way for the development of behaviorism. Classical conditioning involves \nmore than just an association based on temporal contiguity (the food and the \nconditioned stimulus occurring at about the same time; Rescorla, 1967). Effective \nconditioning requires contingency (the presentation of food being contingent on \nthe presentation of the conditioned stimulus; Rescorla & Wagner, 1972; Wagner & \nRescorla, 1972). \nBehaviorism may be considered an extreme version of associationism. It focuses \nentirely on the association between the environment and an observable behavior. \nAccording to strict, extreme (\"radical\") behaviorists, any hypotheses about internal \nthoughts and ways of thinking are nothing more than speculation. \nProponents of Behaviorism \nThe \"father\" of radical behaviorism is John Watson. Watson had no \nuse for internal mental contents or mechanisms. He believed that psychologists \nshould concentrate only on the study of observable behavior. He \ndismissed thinking as subvocalized speech.",
  "meta": {
    "char_count": 1764,
    "word_count": 253
  }
}