{
  "id": "1_Cognitive_Psychology_chunk_27",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 27,
  "text": "ted correct letters \nregardless of the order in which students recalled them. \nIn sum, repeated study helps mainly when the material \nis chunked in the same way from one occasion to \nthe next. \nAn implication of this constant-chunking result is \nthat people will readily recognize and reproduce any \nsymbol sequence that conforms to chunks they already \nknow, that are \"familiar.\" For example, if our example \nletter sequence is grouped as ICBM-CIA-FBI, students easily recognize the familiar abbreviations and \nreadily recall the series. (Some readers may have al \nready recognized these acronyms.) This observation \nillustrates a simple, powerful principle: Human memory works most efficiently when it uses prior learning to \nrecognize familiar chunks among the materials to be \nlearned. By recognizing and exploiting familiar chunks, \nthe expert greatly reduces the amount of new learning \nrequired to master the new material. A large part of \nexpertise in many ability domains-from reading words \nto understanding chemical formulas, mathematical \nequations, musical fragments, computer-program sub \nroutines, and, yes, even Dean's baseball events and \nClaude's chessboard positions-relies upon the brain's \nability to recognize and exploit previously learned \nchunks and quickly assess the new situation confronting us. Such expertise develops slowly only from many \nhundreds of hours of concentrated study of the recur \nring patterns within particular domains. This benefit of \nvery specific practice explains how expert memory in \none domain, such as baseball for Dean or chess for \nClaude, can easily co-exist alongside poor memory in \nunrelated domains such as their daily appointments or \nchemistry lessons. \nThe value of consistent chunking applies to \"re",
  "meta": {
    "char_count": 1765,
    "word_count": 258
  }
}