{
  "id": "1_Cognitive_Psychology_chunk_55",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 55,
  "text": "cs, and other characteristics such as these. But such in \nformation is not readily available, and when it is, it is often available only for \nsome students. In contrast, test scores and grade-point averages are more easily available for all applications. So the college admissions officers may rely \nmore heavily on test scores and grades than they otherwise might if the in \nformation on characteristics such as creativity and ethics were more readily \navailable. \n\nCognitive processes interact with each other and with noncognitive processes:\nAlthough cognitive psychologists try to study and often to isolate the functioning of specific cognitive processes, they know that these processes work \ntogether. For example, memory processes depend on perceptual processes. \nWhat you remember depends in part on what you perceive. Similarly, thinking \nprocesses depend in part on memory processes: You cannot reflect on what you \ndo not remember. But noncognitive processes also interact with cognitive ones. \nFor example, you learn better when you are motivated to learn. However, your \nlearning likely will be reduced if you are upset about something and cannot \nconcentrate on the learning task at hand. Cognitive psychologists therefore \nseek to study cognitive processes not only in isolation but also in their interactions with each other and with noncognitive processes. \nOne of the most exciting areas of cognitive psychology today is at the \ninterface between cognitive and biological levels of analysis. In recent years, \nfor example, it has become possible to localize activity in the brain associated \nwith various kinds of cognitive processes. One has to be careful about assuming that the biological activity is causal of the cognitive activity, however.",
  "meta": {
    "char_count": 1764,
    "word_count": 269
  }
}