{
  "id": "1_Cognitive_Psychology_chunk_7",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 7,
  "text": "es through introspection. \nWundt had many followers. One was an American student, Edward Titchener. Titchener helped bring structuralism to the United States. \nOther early psychologists criticized both the method (introspection) and the focus \n(elementary structures of sensation) of structuralism. \nFunctionalism: An Alternative to Structuralism \nAn alternative to structuralism suggested that psychologists should focus on the processes of thought rather than on its contents. Functionalism seeks to understand what \npeople do and why they do it. This principal question was in contrast to that of the \nstructuralists, who had asked what the elementary contents (structures) of the human \nmind were. Functionalists held that the key to understanding the human mind and \nbehavior was to study the processes of how and why the mind works as it does, rather \nthan to study the structural contents and elements of the mind. \nFunctionalists were unified by the kinds of questions they asked but not necessarily by the answers they found or by the methods they used for finding those answers. \nBecause functionalists believed in using whichever methods best answered a given \nresearcher's questions, it seems natural for functionalism to have led to pragmatism. \nPragmatists believe that knowledge is validated by its usefulness: What can you do \nwith it? Pragmatists are concerned not only with knowing what people do; they want \nto know what we can do with our knowledge of what people do. For example, pragmatists believe in the importance of the psychology of learning and memory. Why? \nBecause it can help us improve the performance of children in school. It can also help \nus learn to remember the names of people we meet whose names we rapidly forget.",
  "meta": {
    "char_count": 1754,
    "word_count": 275
  }
}