{
  "id": "1_Cognitive_Psychology_chunk_20",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 20,
  "text": "the brain in complex interrelationships. \nCuriously, the idea of the mind as modular goes back at least to phrenologist \nFranz-Joseph Gall, who in the late eighteenth century believed \nthat the pattern of bumps and swells on the skull was directly associated with one's \npattern of cognitive skills. Although phrenology itself was not a scientifically valid \ntechnique, the practice of mental cartography lingered and eventually gave rise to \nideas of modularity based on modem scientific techniques. \nResearch Methods in Cognitive Psychology \nGoals of Research \nTo better understand the specific methods used by cognitive psychologists, one must \nfirst grasp the goals of research in cognitive psychology, some of which are highlighted \nhere. Briefly, those goals include data gathering, data analysis, theory development, \nhypothesis formulation, hypothesis testing, and perhaps even application to settings \noutside the research environment. Often researchers simply seek to gather as much \ninformation as possible about a particular phenomenon. They may or may not have \npreconceived notions regarding what they may find while gathering the data. Their \nresearch focuses on describing particular cognitive phenomena, such as how people \nrecognize faces or how they develop expertise. \nData gathering reflects an empirical aspect of the scientific enterprise. Once there \nare sufficient data on the cognitive phenomenon of interest, cognitive psychologists \nuse various methods for drawing inferences from the data. Ideally, they use multiple \nconverging types of evidence to support their hypotheses. Sometimes, just a quick \nglance at the data leads to intuitive inferences regarding patterns that emerge from \nthose data. More commonly, however, researchers use various statistical means of",
  "meta": {
    "char_count": 1796,
    "word_count": 257
  }
}