{
  "id": "1_Cognitive_Psychology_chunk_52",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 52,
  "text": "may be \nviewed as a synthesis may tomorrow be viewed as an extreme position or vice versa. \n\nKey Ideas in Cognitive Psychology \nCertain key ideas seem to keep emerging in cognitive psychology, regardless of the particular phenomenon one studies. Here are what might be considered five major ideas. \nData in cognitive psychology can be fully understood only in the context of an \nexplanatory theory, but theories are empty without empirical data: \nScience is not merely a collection of empirically collected facts. Rather, \nit comprises such facts that are explained and organized by scientific theories. \nTheories give meaning to data. For example, suppose that we know that \npeople's ability to recognize information that they have seen is better than \ntheir ability to recall such information. As an example, they are better at \nrecognizing whether they heard a word said on a list than they are at recalling \nthe word without the word's being given. This is an interesting empirical \ngeneralization. But science requires us not only to be able to make the generalization but also to understand why memory works this way. For one thing, \nan important goal of science is explanation. An empirical generalization does \nnot, in the absence of an underlying theory, provide explanation. For another \nthing, theory helps us understand the limitations of empirical generalizations \nand when and why they occur. For example, a theory proposed by Tulving \nand Thomson suggested that, in fact, recognition should not always \nbe better than recall. An important goal of science is also prediction. Tulving \nand Thomson's theory led them to predict the circumstances under which \nrecall should be better than recognition. Subsequent data collection proved \nthem to be right.",
  "meta": {
    "char_count": 1765,
    "word_count": 278
  }
}