{
  "id": "1_Cognitive_Psychology_chunk_24",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 24,
  "text": "y is. Specifically, we are all severely limited in how many things we can take in and hold even \nbriefly in memory, and consequently in how quickly we \ncan put new information into a more permanent \nmemory. But what are these \"things\" we take in? The \npsychologist George Miller called them \"chunks \nof information\" and proposed that people's immediate \nmemory is limited in terms of the number of chunks \nthey can quickly take in and recall. I wondered whether \nthe prodigious memories of Dean and Claude were as \nsociated with their knowing how to chunk the information of especial significance for them. \nMiller's proposal just led me to ask: What is a \nchunk of information? How big are chunks? What \ndetermines their size and properties ? Are your chunks \nthe same as mine? How do we measure chunks? \nThe intuitive notion is that a chunk is a pattern of \nmore basic elements that a person has learned previously. These patterns can be recognized at several levels of complexity from small to large. For example, the \nphrase \"happy new year\" is for most English speakers a \nsingle chunk composed of 3 familiar sub-chunks \n(words), which are in tum composed of 1 2 familiar \nsub-chunks (letters) and two spaces, 14 symbols in \nall. Suppose, however, that the 14 symbols were laid \nout on the page as \"ha-ppyyne-wyear.\" That series \nnow appears nonsensical and would be difficult to \nlearn. Yet a foreign native without knowledge of the \nEnglish alphabet would find both series equally non \nsensical and difficult to remember. What a chunk is \ndepends on an individual's past learning. \nSo, how hard it is to remember something de \npends on how we perceive it, how we divide it up into \nchunks. But what principles does our brain use to di \nvide elements into perceptual groups ?",
  "meta": {
    "char_count": 1781,
    "word_count": 304
  }
}