{
  "id": "1_Cognitive_Psychology_chunk_12",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 12,
  "text": "than speculation. \nProponents of Behaviorism \nThe \"father\" of radical behaviorism is John Watson. Watson had no \nuse for internal mental contents or mechanisms. He believed that psychologists \nshould concentrate only on the study of observable behavior. He \ndismissed thinking as subvocalized speech. Behaviorism also differed from previous \nmovements in psychology by shifting the emphasis of experimental research from \nhuman to animal participants. Historically, much behaviorist work has been con \nducted (and still is) with laboratory animals, such as rats, because these animals \nallow for much greater behavioral control of relationships between the environment and the behavior emitted in reaction to it. One problem with using animals, \nhowever, is determining whether the research can be generalized to humans (applied more generally to humans instead of just to the kinds of animals that were studied) . Skinner, a radical behaviorist, believed that virtually all forms of \nhuman behavior, not just learning, could be explained by behavior emitted in reaction \nto the environment. Skinner conducted research primarily with nonhuman animals. \nHe rejected mental mechanisms. He believed instead that operant conditioning \ninvolving the strengthening or weakening of behavior, contingent on the presence or \nabsence of reinforcement (rewards) or punishments---could explain all forms of human \nbehavior. Skinner applied his experimental analysis of behavior to many psychological \nphenomena, such as learning, language acquisition, and problem solving. Largely be \ncause of Skinner's towering presence, behaviorism dominated the discipline of psychology for several decades. \nBehaviorists Daring to Peek into the Black Box \nSome psychologists rejected radical behaviorism.",
  "meta": {
    "char_count": 1780,
    "word_count": 249
  }
}