{
  "id": "1_Cognitive_Psychology_chunk_53",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 53,
  "text": "gested that, in fact, recognition should not always \nbe better than recall. An important goal of science is also prediction. Tulving \nand Thomson's theory led them to predict the circumstances under which \nrecall should be better than recognition. Subsequent data collection proved \nthem to be right. Under some circumstances, recall is indeed better than \nrecognition. Theory therefore suggested under which circumstances, among \nthe many circumstances one might examine, limitations to the generalization \nshould occur. Theory thus assists both in explanation and prediction. \nAt the same time, theory without data is empty. Almost anyone can sit \nin an armchair and propose a theory-even a plausible-sounding one. Science, however, requires empirical testing of such theories. Without such testing, theories remain merely speculative. Thus, theories and data depenJ on each other. Theories generate data collections, which help correct theories, \nwhich then lead to further data collections, and so forth. It is through this \niteration of and interaction between theory and data that we increase scientific understanding. \n\nCognition is generally adaptive but not in all specific instances: \nWhen we consider all the ways in which we can make mistakes, it is astonishing how well our cognitive systems operate. Evolution has served us well in \nshaping the development of a cognitive apparatus that is able accurately to \ndecode environmental stimuli. It also can understand internal stimuli that \nmake the most of the information available to us. We can perceive, learn, re \nmember, reason, and solve problems with great accuracy. And we do so even \nthough we constantly are barraged by a plethora of stimuli. Any of the stimuli \neasily could distract us from processing information properly.",
  "meta": {
    "char_count": 1795,
    "word_count": 271
  }
}