{
  "id": "1_Cognitive_Psychology_chunk_4",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 4,
  "text": "are \nboth incomplete. Nature and nurture work together in our development. \nIf a synthesis seems to advance our understanding of a subject, it then serves as a \nnew thesis. A new antithesis then follows it, then a new synthesis, and so on. Georg \nHegel observed this dialectical progression of ideas. He was a German \nphilosopher who came to his ideas by his own dialectic. He synthesized some of the \nviews of his intellectual predecessors and contemporaries. \nPhilosophical Antecedents of Psychology: \nRationalism versus Empiricism \nWhere and when did the study of cognitive psychology begin? Historians of psychology usually trace the earliest roots of psychology to two different approaches to understanding the human mind: \n Philosophy seeks to understand the general nature of many aspects of the world, \nin part through introspection, the examination of inner ideas and experiences \n(from intra-, \"inward, within,\" and -spect, \"look\"). \n Physiology seeks a scientific study of life-sustaining functions in living matter, \nprimarily through empirical (observation based) methods. \nTwo approaches to the study of the mind are rationalism and empiricism. A rationalist believes that the route to knowledge is through logical analysis. In contrast, \nAristotle (a naturalist and biologist as well as a philosopher) was an empiricist. An \nempiricist believes that we acquire knowledge via empirical evidence that is, we \nobtain evidence through experience and observation. \nEmpiricism leads directly to empirical investigations of psychology. In contrast, \nrationalism is important in theory development. Rationalist theories without any \nconnection to observations may not be valid. But mountains of observational data \nwithout an organizing theoretical framework may not be meaningful.",
  "meta": {
    "char_count": 1788,
    "word_count": 259
  }
}