{
  "id": "1_Cognitive_Psychology_chunk_13",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 13,
  "text": "logical \nphenomena, such as learning, language acquisition, and problem solving. Largely be \ncause of Skinner's towering presence, behaviorism dominated the discipline of psychology for several decades. \nBehaviorists Daring to Peek into the Black Box \nSome psychologists rejected radical behaviorism. They were curious about the con \ntents of the mysterious box. For example, Edward Tolman thought that \nunderstanding behavior required taking into account the purpose of, and the plan for, \nthe behavior. Tolman believed that all behavior is directed toward some goal. \nFor example, the goal of a rat in a maze may be to try to find food in that maze. Tol \nman is sometimes viewed as a forefather of modern cognitive psychology. \nAnother criticism of behaviorism is that learning appears to \nresult not merely from direct rewards for behavior. It also can be social, resulting from \nobservations of the rewards or punishments given to others. The ability to learn \nthrough observation is well documented and can be seen in humans, monkeys, dogs, \nbirds, and even fish. In humans this ability spans all ages; it is observed in both infants and \nadults. This view emphasizes how we ob \nserve and model our own behavior after the behavior of others. We learn by example. \nThis consideration of social learning opens the way to considering what is happening \ninside the mind of the individual. \nGestalt Psychology \nOf the many critics of behaviorism, Gestalt psychologists may be among the most avid. \nGestalt psychology states that we best understand psychological phenomena when we \nview them as organized, structured wholes. According to this view, we cannot fully understand behavior when we only break phenomena down into smaller parts. For example,",
  "meta": {
    "char_count": 1750,
    "word_count": 275
  }
}