{
  "id": "1_Cognitive_Psychology_chunk_22",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 22,
  "text": "pected empirical consequences of the theory, such as the outcomes of research. \nNext, we test our hypotheses through experimentation. Even if particular findings appear to confirm a given hypothesis, the findings must be subjected to statistical \nanalysis to determine their statistical significance. Statistical significance indicates \nthe likelihood that a given set of results would be obtained if only chance factors were \nin operation. For example, a statistical significance level of. 05 would mean that the \nlikelihood of a given set of data would be a mere 5% if only chance factors were operating. Therefore, the results are not likely to be due merely to chance. Through this \nmethod we can decide to retain or reject hypotheses. \nOnce our hypothetical predictions have been experimentally tested and statistically \nanalyzed, the findings from those experiments may lead to further work. For example, the \npsychologist may engage in further data gathering, data analysis, theory development, \nhypothesis formulation, and hypothesis testing. Based on the hypotheses that were retained and/or rejected, the theory may have to be revised. In addition, many cognitive \npsychologists hope to use insights gained from research to help people use cognition in \nreal-life situations. Some research in cognitive psychology is applied from the start. It \nseeks to help people improve their lives and the conditions under which they live their \nlives. Thus, basic research may lead to everyday applications. For each of these purposes, \ndifferent research methods offer differing advantages and disadvantages. \n\nCHUNKY EXPERTS WHO \nDIVIDE TO CONQUER \nGrowing up as a boy in small \ntown Ohio, I devoted hundreds \nof hours to playing baseball. My \noldest coach, Dean Harrah, had",
  "meta": {
    "char_count": 1775,
    "word_count": 269
  }
}