{
  "id": "1_Cognitive_Psychology_chunk_5",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 5,
  "text": "ads directly to empirical investigations of psychology. In contrast, \nrationalism is important in theory development. Rationalist theories without any \nconnection to observations may not be valid. But mountains of observational data \nwithout an organizing theoretical framework may not be meaningful. We might see \nthe rationalist view of the world as a thesis and the empirical view as an antithesis. \nMost psychologists today seek a synthesis of the two. They base empirical observations on theory. In tum, they use these observations to revise their theories. Accordmg to the ranonaizst, the only route to truth is reasoned contemplation; according to the empiricist, the only route to truth \nis meticulous observanon. Cogmtive psychology, like other SClences , depends on the work of both rationalists and emplricists. \nThe contrasting ideas of rationalism and empiricism became prominent with the \nFrench rationalist Rene Descartes and the British empiricist John Locke. Descartes viewed the introspective, reflective method as being superior \nto empirical methods for finding truth. Locke, in contrast, had more enthusiasm for \nempirical observation. \nLocke believed that humans are born without knowledge and therefore must seek \nknowledge through empirical observation. Locke's term for this view was tabula rasa \n(meaning \"blank slate\" in Latin). The idea is that life and experience \"write\" knowledge on us. For Locke, then, the study of learning was the key to understanding the \nhuman mind. He believed that there are no innate ideas whatsoever. In the eighteenth century, German philosopher Immanuel Kant dialectically synthesized the views of Descartes and Locke, arguing that both rationalism and empiricism have their place. Both must work together in the quest for truth. Most",
  "meta": {
    "char_count": 1793,
    "word_count": 267
  }
}