{
  "id": "1_Cognitive_Psychology_chunk_46",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 46,
  "text": "make more \nmistakes than your friends in group 2 because they have established the wrong set of \nexpectations for answering the question. \nCase studies (the study of exceptionally gifted individuals) and naturalistic \nobservations (the observation of individuals operating in nuclear power plants) \nmay be used to complement findings from laboratory experiments. These two methods of cognitive research offer high ecological validity, the degree to which particular \nfindings in one environmental context may be considered relevant outside of that \ncontext. As you probably know, ecology is the study of the interactive relationship \nbetween an organism (or organisms) and its environment. Many cognitive psychologists seek to understand the interactive relationship between human thought processes and the environments in which humans are thinking. Sometimes, cognitive \nprocesses that commonly are observed in one setting (in a laboratory) are not \nidentical to those observed in another setting (in an air-traffic control tower or \na classroom). \n\n\n\n\nComputer Simulations and Artificial Intelligence \nDigital computers played a fundamental role in the emergence of the study of cognitive psychology. One kind of influence is indirect-through models of human cognition based on models of how computers process information. Another kind is \ndirect-through computer simulations and artificial intelligence. \nIn computer simulations , researchers program computers to imitate a given hu \nman function or process. Examples are performance on particular cognitive tasks \n(manipulating objects within three-dimensional space) and performance of \nparticular cognitive processes (pattern recognition). Some researchers even",
  "meta": {
    "char_count": 1717,
    "word_count": 236
  }
}