{
  "id": "1_Cognitive_Psychology_chunk_25",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 25,
  "text": "ally non \nsensical and difficult to remember. What a chunk is \ndepends on an individual's past learning. \nSo, how hard it is to remember something de \npends on how we perceive it, how we divide it up into \nchunks. But what principles does our brain use to di \nvide elements into perceptual groups ? \nA major grouping principle is how close together \nor bunched up they are in time or space. Thus, the \nempty spaces (dashes) in IC-BMIC-IAF-BI \ncauses people to see the series as chunks of 2, 4, 3, and \n2 letters, respectively. Those groupings capture perception and are copied into a person's immediate \nmemory. Moreover, if students were to study and try \nto reproduce a number of such strings repeatedly, they \nwould eventually recall the series in \"all-or-none\" \nchunks. That is, most of their recall errors would crop \nup as they tried to move in recall between chunks (at \nthe C to B, the C to I, and the F to B transitions). \nA second principle of grouping is that elements \nthat look or sound alike will be grouped together. For \nexample, letters similar in size, shape (font), and \ncolor will be grouped together and recalled as units. \nJust as closeness in space and appearance influence visual grouping, so does closeness in time and \nquality of sounds influence grouping of spoken words \nand musical notes. Thus, hearing the above letter series spoken with pauses between groups will cause \npeople to adopt that chunking and recall those groups. \nSimilar groupings would arise if the chunks were simi \nlar in being spoken by different voices or in coming \nfrom different locations. Such auditory groupings are \nreflected in our habit of conveying telephone numbers \nin a 3-3-4 cadence, as in 555-123-4567, and are \nbrought to masterful complexity in the sophisticated",
  "meta": {
    "char_count": 1778,
    "word_count": 299
  }
}