{
  "id": "1_Cognitive_Psychology_chunk_8",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 8,
  "text": "ur knowledge of what people do. For example, pragmatists believe in the importance of the psychology of learning and memory. Why? \nBecause it can help us improve the performance of children in school. It can also help \nus learn to remember the names of people we meet whose names we rapidly forget. \nA leader in guiding functionalism toward pragmatism was William James. His chief functional contribution to the field of psychology was a single book: \nhis landmark Principles of Psychology. Even today, cognitive psychologists \nfrequently point to the writings of James in discussions of core topics in the field, such \nas attention, consciousness, and perception. John Dewey was another \nearly pragmatist who profoundly influenced contemporary thinking in cognitive psychology. Dewey is remembered primarily for his pragmatic approach to thinking and \nschooling. \nPRACTICAL APPLICATIONS OF COGNITIVE PSYCHOLOGY\nTake a moment right now to put the idea of pragmatism into use. Think about ways \nto make the information you are learning in this course more useful to you. Part of the \nwork already has been done-notice that the chapter begins with questions that make \nthe information more coherent and useful, and the chapter summary returns to those \nquestions. Does the text successfully answer the questions posed at the beginning of \nthe chapter? Come up with your own questions and try organizing your notes in the \nform of answers to your questions. Also, try relating this material to other courses or \nactivities you participate in. For example, you may be called on to explain to a friend \nhow to use a new computer program. A good way to start would be to ask that person \nif he or she has any questions. That way, the information you provide is more directly",
  "meta": {
    "char_count": 1768,
    "word_count": 288
  }
}