{
  "id": "1_Cognitive_Psychology_chunk_1",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 1,
  "text": "Cognitive Psychology Defined \nConsider just the last of these questions: Why do candidates spend so much \nmoney on television advertisements? After all, how many people remember the de \ntails of their political positions, or how their positions are distinguished from others' \npolitical positions? One reason candidates spend so much is because of the availability \nheuristic, which you will study in Chapter 12.\nUsing this heuristic, we make judgments on the basis of how easily we can call to mind what we perceive as relevant instances \nof a phenomenon. One such judgment is the question \nof for whom one should vote in an election. We are much more likely to vote for \nsomeone whose name is familiar. Tom Vilsack, governor of the state of Iowa at the \ntime of the 2008 primary campaign, entered and quickly dropped out of the contest \nfor the Democratic candidacy for President of the United States. He dropped out not \nbecause his positions were incompatible with those of the party: On the contrary, \nmany Democrats liked his positions. Rather, he dropped out because his lack of name \nrecognition made it difficult to raise money. In the end, possible donors felt that his \nname was not \"available\" enough for people to vote for him when election day came. \nMitt Romney, less well known than Republican primary competitors John McCain \nand Rudy Giuliani, spent large sums of money just to make his name psychologically \navailable to the general public. The bottom line is that understanding cognitive psy \nchology can help us understand much of what goes on in our everyday lives. \nThis chapter introduces the field of cognitive psychology. It describes some of the \nintellectual history of the study of human thinking. It particularly emphasizes some of",
  "meta": {
    "char_count": 1761,
    "word_count": 289
  }
}