{
  "id": "1_Cognitive_Psychology_chunk_47",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 47,
  "text": "simulations , researchers program computers to imitate a given hu \nman function or process. Examples are performance on particular cognitive tasks \n(manipulating objects within three-dimensional space) and performance of \nparticular cognitive processes (pattern recognition). Some researchers even \nhave attempted to create computer models of the entire cognitive architecture of \nthe human mind. Their models have stimulated heated discussions regarding how \nthe human mind may function as a whole. Sometimes the distinction between simulation and artificial intelligence is blurred. An example would be \ncertain programs that are designed to simulate human performance and to maximize \nfunctioning simultaneously. \nConsider, for example, a program that plays chess. There are two entirely different ways to conceptualize how to write such a program. One is known as brute force: \nOne constructs an algorithm that considers extremely large moves in a very short \ntime, potentially beating human players simply by virtue of the number of moves it \nconsiders and the future potential consequences of these moves. The program would \nbe viewed as successful to the extent that it beat the best humans. This kind of artificial intelligence does not seek to represent how humans function, but done well it \ncan produce a program that plays chess at the highest possible level. An alternative \napproach, that of simulation, looks at how chess grandmasters solve chess problems \nand then seeks to function the way they do. The program would be viewed as successful if it chose, in a sequence of moves in a game, the same moves that the grandmas \nter would choose. It is also possible to combine the two approaches, producing a",
  "meta": {
    "char_count": 1719,
    "word_count": 266
  }
}