{
  "id": "1_Cognitive_Psychology_chunk_37",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 37,
  "text": "ion show a statistically significant \ndifference from the outcomes in the control condition. The experimenter then can \ninfer the likelihood of a causal link between the independent variable or variables and the \ndependent variable. Because the researcher can establish a likely causal link between \nthe given independent variables and the dependent variables, controlled laboratory \nexperiments offer an excellent means of testing hypotheses. \nFor example, suppose that we wanted to see whether loud, distracting noises \ninfluence the ability to perform well on a particular cognitive task (reading a \npassage from a textbook and responding to comprehension questions). Ideally, we \nfirst would select a random sample of participants from within our total population \nof interest. We then would randomly assign each participant to a treatment condition or a control condition. Then we would introduce some distracting loud noises \nto the participants in our treatment condition. The participants in our control \ncondition would not receive this treatment. We would present the cognitive task \nto participants in both the treatment condition and the control condition. We \nthen would measure their performance by some means (speed and accuracy of \nresponses to comprehension questions) . Finally, we would analyze our results statistically. We thereby would examine whether the difference between the two \ngroups reached statistical significance. Suppose the participants in the treatment \ncondition showed poorer performance at a statistically significant level than the \nparticipants in the control condition. We then might infer that loud distracting \nnoises did, indeed, influence the ability to perform well on this particular cognitive \ntask.",
  "meta": {
    "char_count": 1748,
    "word_count": 253
  }
}