{
  "id": "1_Cognitive_Psychology_chunk_40",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 40,
  "text": "rn or relationship in \nthe change of two variables (intelligence and earlobe length) . In this final \ncase, both variables may change, but the variables do not vary together in a consistent pattern. \nFindings of statistical relationships are highly informative. Their value should \nnot be underrated. Also, because correlational studies do not require the random assignment of participants to treatment and control conditions, these methods may be \napplied flexibly. However, correlational studies generally do not permit unequivocal \ninferences regarding causality. As a result, many cognitive psychologists strongly pre \nfer experimental data to correlational data. \nPsychobiological Research \nThrough psychobiological research, investigators study the relationship between cognitive performance and cerebral events and structures. \nspecific techniques used in psychobiological research. These techniques generally fall \ninto three categories. The first category is that of techniques for studying an individual's brain postmortem (after the death of an individual), relating the individual's \ncognitive function prior to death to observable features of the brain. The second \ncategory is techniques for studying images showing structures of or activities in the \nbrain of an individual who is known to have a particular cognitive deficit. The third \nis techniques for obtaining information about cerebral processes during the normal \nperformance of a cognitive activity. \nPostmortem studies offered some of the first insights into how specific lesions \n(areas of injury in the brain) may be associated with particular cognitive deficits. \nSuch studies continue to provide useful insights into how the brain influences cognitive function.",
  "meta": {
    "char_count": 1740,
    "word_count": 242
  }
}