{
  "id": "1_Cognitive_Psychology_chunk_54",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 54,
  "text": "hat \nmake the most of the information available to us. We can perceive, learn, re \nmember, reason, and solve problems with great accuracy. And we do so even \nthough we constantly are barraged by a plethora of stimuli. Any of the stimuli \neasily could distract us from processing information properly. The same processes, however, that lead us to perceive, remember, and reason accurately in \nmost situations also can lead us astray. Our memories and reasoning processes, \nfor example, are susceptible to certain well-identified, systematic errors. For \nexample, as we saw when we learned about the availability heuristic, we tend \nto overvalue information that is easily available to us. We do this even when \nthis information is not optimally relevant to the problem at hand. In general, \nall systems, natural or artificial, are based on tradeoffs. The same characteristics that make them highly efficient in a large variety of circumstances can \nrender them inefficient in specialized circumstances. A system that would be \nextremely efficient in each specialized circumstance would be inefficient across \na wide variety of circumstances simply because it would become too cumber \nsome and complex. Humans thus represent a highly efficient, but imperfect, \nadaptation to the environments they face. \nConsider, as an example of availability, college admissions. Most admissions officers would like to know a lot about students' leadership skills, their \ncreativity, their ethics, and other characteristics such as these. But such in \nformation is not readily available, and when it is, it is often available only for \nsome students. In contrast, test scores and grade-point averages are more easily available for all applications. So the college admissions officers may rely",
  "meta": {
    "char_count": 1775,
    "word_count": 272
  }
}