{
  "id": "1_Cognitive_Psychology_chunk_17",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 17,
  "text": ", by humans, from the out \nput of humans. In other words, suppose you communicated with a computer and you could not tell that it was a computer. The computer then passed the Turing test. By 1956 a new phrase had \nentered our vocabulary. Artificial intelligence (AI) is the attempt by humans to con \nstruct systems that show intelligence and, particularly, the intelligent processing of in \nformation. Chess-playing programs, \nwhich now can beat most humans, are examples of artificial intelligence. \nMany of the early cognitive psychologists became interested in cognitive psychology through applied problems. For example, according to Berry, Donald Broad \nbent claimed to have developed an interest in cognitive psychology \nthrough a puzzle regarding AT6 aircraft. The planes had two almost identical levers \nunder the seat. One lever was to pull up the wheels and the other to pull up the flaps. \nPilots apparently regularly mistook one for the other, thereby crashing expensive planes \nupon take-off. During World War II, many cognitive psychologists, including one of my \nown advisors, Wendell Garner, consulted with the military in solving practical problems of aviation and other fields that arose out of warfare against enemy forces. Information theory, which sought to understand people's behavior in terms of how they process \nthe kinds of bits of information processed by computers, \nalso grew out of problems in engineering and informatics. \nApplied cognitive psychology also has had great use in advertising. John Watson, \nafter he left Johns Hopkins University as a professor, became an extremely successful \nexecutive in an advertising firm and used his knowledge of psychology to reach his success. Indeed, much of advertising has directly used principles from cognitive psychology",
  "meta": {
    "char_count": 1797,
    "word_count": 276
  }
}