{
  "id": "1_Cognitive_Psychology_chunk_39",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 39,
  "text": "olving. The researcher cannot randomly assign participants to various age groups because people's ages cannot be \nmanipulated (although participants of various age groups can be assigned at random \nto various experimental conditions). In such situations researchers often use other \nkinds of studies. Examples are studies involving correlation (a statistical relationship \nbetween two or more attributes, such as characteristics of the participants or of a \nsituation). Correlations are usually expressed through a correlation coefficient known \nas Pearson's r. Pearson's r is a number that can range from -1 .00 (a negative correlation) to 0 (no correlation) to 1 .00 (a positive correlation). \nA correlation is a description of a relationship. The correlation coefficient \ndescribes the strength of the relationship. The closer the coefficient is to 1 (either \npositive or negative), the stronger the relationship between the variables is. The \nsign (positive or negative) of the coefficient describes the direction of the relation \nship. A positive relationship indicates that as one variable increases (evocabulary size), another variable also increases (reading comprehension). A negative relationship indicates that as the measure of one variable increases (fatigue), the measure of another decreases (alertness). No correlation-that is, when the coefficient is O-indicates that there is no pattern or relationship in \nthe change of two variables (intelligence and earlobe length) . In this final \ncase, both variables may change, but the variables do not vary together in a consistent pattern. \nFindings of statistical relationships are highly informative. Their value should \nnot be underrated.",
  "meta": {
    "char_count": 1702,
    "word_count": 246
  }
}