{
  "id": "1_Cognitive_Psychology_chunk_44",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 44,
  "text": "formation. Unintentional misreports may involve \nnot understanding the question or not remembering the information accurately. For \nexample, when a participant is asked about the problem-solving strategies he or she \nused in high school, the participant may not remember. The participant may try to \nbe completely truthful in his or her reports. But reports involving recollected information (diaries, retrospective accounts, questionnaires, and surveys) are notably less reliable than reports provided during the cognitive processing under investigation. The reason is that participants sometimes forget what they did. In studying \ncomplex cognitive processes, such as problem solving or decision making, research \ners often use a verbal protocol. In a verbal protocol, the participants describe aloud \nall their thoughts and ideas during the performance of a given cognitive task (\"I like the apartment with the swimming pool better, but I can't really afford it, so \nI might choose.\"). \nAn alternative to a verbal protocol is for participants to report specific information regarding a particular aspect of their cognitive processing. Consider, for example, \na study of insightful problem solving. Participants were asked at 15 second intervals to report numerical ratings indicating how close they felt they \nwere to reaching a solution to a given problem. Unfortunately, even these methods \nof self-reporting have their limitations. As one example, cognitive processes may be \naltered by the act of giving the report (processes involving brief forms of memory) . As another example, cognitive processes may occur outside of conscious awareness (processes that do not require conscious attention or that take \nplace so rapidly that we fail to notice them. To get an idea of some of",
  "meta": {
    "char_count": 1785,
    "word_count": 268
  }
}