{
  "id": "1_Cognitive_Psychology_chunk_56",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 56,
  "text": "ognitive and biological levels of analysis. In recent years, \nfor example, it has become possible to localize activity in the brain associated \nwith various kinds of cognitive processes. One has to be careful about assuming that the biological activity is causal of the cognitive activity, however. \nResearch shows that learning that causes changes in the brain-in other \nwords, cognitive processes-can affect biological structures just as biological \nstructures can affect cognitive processes. So the interactions between cognition and other processes occur at many levels. The cognitive system does not \noperate in isolation. It works in interaction with other systems. \n\nCognition needs to be studied through a variety of scientific methods: \nThere is no one right way to study cognition. Naive researchers some \ntimes seek the \"best\" method by which to study cognition. Their search inevitably will be in vain. All cognitive processes need to be studied through a \nvariety of converging operations. That is, varied methods of study seek a common understanding. The more different kinds of techniques that lead to the \nsame conclusion, the higher the confidence one can have in that conclusion. \nFor example, suppose studies of reaction times, error rates, and patterns of \nindividual differences all lead to the same conclusion. Then one can have \nmuch more confidence in the conclusion than if only one method led to that \nconclusion. \nCognitive psychologists need to learn a variety of different kinds of tech \nniques to do their job well. All these methods, however, must be scientific. \nScientific methods differ from other methods in that they provide the basis \nfor the self-correcting nature of science. Eventually we correct our errors. The",
  "meta": {
    "char_count": 1752,
    "word_count": 271
  }
}