{
  "id": "1_Cognitive_Psychology_chunk_30",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 30,
  "text": "were unrelated to a predesignated category.\n\nMETHOD: PSYCHOBIOLOGICAL RESEARCH\nDescription of method:\nStudy animal brains and human brains, using postmortem studies and various psychobiological measures or imaging techniques.\nValidity of causal inferences: random assignment of subjects:\nNot usually.\nValidity of causal inferences: experimental control of independent variables:\nVaries widely, depending on the particular technique.\nSamples: size:\nOften small.\nSamples: representativeness:\nOften not representative.\nEcological validity:\nUnlikely under some circumstances.\nInformation about individual differences:\nYes.\nStrengths:\nProvides “hard” evidence of cognitive functions by relating them to physiology;\nOffers an alternative view of cognitive processes unavailable by other means;\nMay lead to possibilities for treating persons with serious cognitive deficits.\nWeaknesses:\nLimited accessibility for most researchers;\nRequires access to specific appropriate subjects and to equipment that may be extremely expensive and difficult to obtain;\nSmall samples;\nMany studies are based on studies of abnormal brains or of animals;\nIn general, applying findings to normal human populations may be troublesome.\nExamples:\nElizabeth Warrington and Tim Shallice have observed that lesions (areas of injury) in the left parietal lobe of the brain are associated with serious deficits in short-term (brief, active) memory and the impairment of long-term memory, but persons with lesions in the right parietal lobe show the opposite pattern:\nthemes+ in the brain show relatively normal short-term memory but grave deficits in long-term memory.\n\nMETHOD: SELF-REPORTS, SUCH AS VERBAL PROTOCOLS, SELF-RATINGS, DIARIES\nDescription of method:",
  "meta": {
    "char_count": 1728,
    "word_count": 233
  }
}