{
  "id": "1_Cognitive_Psychology_chunk_41",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 41,
  "text": "formance of a cognitive activity. \nPostmortem studies offered some of the first insights into how specific lesions \n(areas of injury in the brain) may be associated with particular cognitive deficits. \nSuch studies continue to provide useful insights into how the brain influences cognitive function. Recent technological developments also have increasingly enabled \nresearchers to study individuals with known cognitive deficits in vivo (while the \nindividual is alive). The study of individuals with abnormal cognitive functions \nlinked to cerebral damage often enhances our understanding of normal cognitive \nfunctions. \nIn addition, psychobiological researchers study some aspects of normal cognitive \nfunctioning by studying cerebral activity in animal participants. Researchers often use \nanimal participants for experiments involving neurosurgical procedures that cannot \nbe performed on humans because such procedures would be difficult, unethical, or \nimpractical. For example, studies mapping neural activity in the cortex have been \nconducted on cats and monkeys (psychobiological research on how the brain \nresponds to visual stimuli)\nCan cognitive and cerebral functioning of animals and of abnormal humans be \ngeneralized to apply to the cognitive and cerebral functioning of normal humans? \nPsychobiologists have responded to these questions in various ways. Most of them go \nbeyond the scope of this chapter \nAs just one example, for some kinds of cognitive activity, the available technology permits researchers to study the dynamic cerebral activity of normal human participants during cognitive processing.\nSelf-Reports, Case Studies, and Naturalistic Observation",
  "meta": {
    "char_count": 1682,
    "word_count": 232
  }
}