{
  "id": "1_Cognitive_Psychology_chunk_0",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 0,
  "text": "Cognitive Psychology Defined \nWhat will you be studying in a textbook about cognitive psychology? \nCognition: People think. \nCognitive psychology: Scientists think about how people think. \nStudents of cognitive psychology: People think about how scientists think \nabout how people think. \nProfessors who profess to students about cognitive psychology: You get the idea. \nTo be more specific, cognitive psychology is the study of how people perceive, \nlearn, remember, and think about information. A cognitive psychologist might study \nhow people perceive various shapes, why they remember some facts but forget others, \nor how they learn language. Consider some examples: \n Why do objects look farther away on foggy days than they really are? The discrepancy can be dangerous, even deceiving drivers into having car accidents. \n Why do many people remember a particular experience (have very happy moment or an embarrassment during childhood), yet they forget the names of \npeople whom they have known for many years? \n Why are many people more afraid of traveling in planes than in automobiles? \nAfter all, the chances of injury or death are much higher in an automobile than \nin a plane. \n Why do I often well remember people I met in my childhood but not people I \nmet a week ago? \n Why do candidates spend so much money on television advertisements? \nThese are some of the kinds of questions that we can answer through the study \nof cognitive psychology. \n\nCognitive Psychology Defined \nConsider just the last of these questions: Why do candidates spend so much \nmoney on television advertisements? After all, how many people remember the de \ntails of their political positions, or how their positions are distinguished from others' \npolitical positions?",
  "meta": {
    "char_count": 1758,
    "word_count": 274
  }
}