{
  "id": "1_Cognitive_Psychology_chunk_26",
  "book_id": "1_Cognitive_Psychology",
  "source_file": "Cognitive Psychology.txt",
  "source_path": "Convert_Books\\TestBookClean\\Cognitive Psychology.txt",
  "chunk_index": 26,
  "text": "d arise if the chunks were simi \nlar in being spoken by different voices or in coming \nfrom different locations. Such auditory groupings are \nreflected in our habit of conveying telephone numbers \nin a 3-3-4 cadence, as in 555-123-4567, and are \nbrought to masterful complexity in the sophisticated \ntempos and rhythms of music. \nSo, what's this chunking business got to do with \nlearning and memory? Plenty. I hypothesized that the \nquickest way to learn something is to study and repro \nduce it repeatedly using the same chunk structure from \none occasion to the next. Thus, to learn to reproduce \nIC-BMCI-AFB---I, it's best to study exactly those \nchunks in that order every time. Our experiments with \ncollege students found that they accumulate little or no \nlearning of a collection of different sequences if we \nchanged the groupings every time the students studied \nthem. Thus, for our previous example series, students \nwere likely to perceive a different grouping of the letters, such as I-CBM-CI-AF-BI or ICB---MC \nIAFB---I, as a nearly novel sequence of letters, causing \ntheir immediate recall of it to be just as poor as when \nit was first presented. Was their failure due to being \nconfused about where to put the spaces or pauses as \nthey reproduced the series ? Not at all, because they \nknew that only the letters needed to be recalled in \ntheir order, not the spaces. Moreover, the deficit was \nabout the same when we simply counted correct letters \nregardless of the order in which students recalled them. \nIn sum, repeated study helps mainly when the material \nis chunked in the same way from one occasion to \nthe next. \nAn implication of this constant-chunking result is \nthat people will readily recognize and reproduce any",
  "meta": {
    "char_count": 1746,
    "word_count": 288
  }
}